{
  "sutra": "Avatamsaka Sutra (Flower Garland Sutra)",
  "protagonist": "Sudhana",
  "chapters": [
    {
      "chapter_number": 1,
      "chapter_title": "Shakyamuni Buddha",
      "name_translation": "The enlightened",
      "location": "JETAVANA, IN ANĀTHAPIṆḌADA'S PARK IN ŚRĀVASTĪ.",
      "context": "The Buddha is in a magnificently adorned Kūṭāgāra in Jetavana, preparing for a great teaching. The chapter serves as the cosmic scenario for the whole Sutra.",
      "assembly_present": "A vast assembly consisting of: 5,000 bodhisattvas, led by prominent figures such as Samantabhadra and Mañjuśrī (the exhaustively list of hundreds of names to illustrate the magnitude);500 śrāvakas with miraculous powers, including śāriputra and maudgalyāyana;and countless gentlemen of the world (devas, etc.) who are devoted to Mahāyāna.",
      "main_dialogue": "The Assembly, recognizing the inconceivable depth of Buddha's power and wisdom, makes a long, detailed supplication.They ask the Buddha to teach not only the Dharma, but to reveal all his journey: from his Bodhisattva practices in past lives, the purification of his Buddic kingdoms, to the manifestation of his powers, the turn of the Dharma wheel and how he interacts with all beings.",
      "main_teaching": "In response to the request, Buddha does not offer a verbal teaching.Instead, he enters the Samādhi called \"The Lion's Road\".This meditative act is the teaching itself, a manifestation of power that transforms reality and prepares the scenario for the revelations that will follow.",
      "miraculous_manifestations": "The entrance to Samādhi triggers a cosmic transformation",
      "spiritual_progression": "The chapter establishes a crucial distinction in the ability to perceive the assembly.Bodhisattvas and other beings with merit and aspiration Mahāyāna can fully perceive miraculous manifestations.In contrast, the great śrāvakas, though physically present, are completely unable to see, hear or perceive any of these miracles.",
      "transition": "The chapter ends with each of the ten bodhisattvas visitors reciting verses that praise the Buddha, his wisdom and the miracles that witnessed.This solidifies the magnificence of the scenario and prepares the assembly for the teaching that will be articulated by Samantabhadra in the next chapter.",
      "unique_elements": "'- The blindness of the śrāvakas: The Sutra dedicates a long section to explaining why the śrāvakas cannot see the miracles, using multiple analogies (black that do not see the ganges, a man dreaming of a divine palace, people without herbs in Himalayan).Reason is the fundamental difference in their aspirations and merits, focused on their own benefit instead of omniscience for the good of all.",
      "character": {
        "name": "Buddha śākyamuni",
        "teaching": "In response to teaching requests, Buddha does not offer a verbal teaching. Instead, he enters the Samādhi called \"The Lion's Road\". This meditative act is the teaching itself, a manifestation of power that transforms reality and prepares the scenario for the revelations that will follow.",
        "description": "The Buddha is in a magnificently adorned Kūṭāgāra in Jetavana.",
        "occupation": "Buddha",
        "meaning": "The enlightened",
        "local": "JETAVANA, IN ANEMHAPI PARK IN śrāvastī.",
        "summary": "O Buda Śākyamuni está em Jetavana em Śrāvastī com cinco mil bodhisattvas e quinhentos śrāvakas. Em suas mentes, eles desejam um ensinamento e, portanto, o Buda entra em samādhi, e incontáveis reinos búdicos aparecem ali dentro de um vasto kūṭāgāra. Os bodhisattvas também vêm de outros reinos para o Śrāvastī. Os śrāvakas, desprovidos do mérito necessário, são incapazes de ver esta exibição milagrosa.",
        "chapter_file_name": "01 THE SETTING Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1nUGjdViJ3r4ZhfBBNxYs2hWzFUgYNfb5/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=1",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo1.glb"
      }
    },
    {
      "chapter_number": 2,
      "chapter_title": "Samantabhadra",
      "name_translation": "Completely good",
      "location": "JETAVANA, IN ANĀTHAPIṆḌADA'S PARK IN ŚRĀVASTĪ.",
      "context": "After the Buddha enters Samādhi \"The Roor of the Lion\", Bodhisattva Samantabhadra takes the lead to explain the depth of this state to the Assembly.",
      "assembly_present": "The Great Assembly of Bodhisattvas gathered in Jetavana. They are not only passive listeners, but active participants who, after being illuminated by the Buddha light, manifest their own miraculous powers.",
      "main_dialogue": "Samantabhadra first teaches in prose and then recites poetic verses to reinforce the ten points. At the end of the chapter, after the manifestations of the Buddha, Mañjuśrī also recites verses, observing and praising the miracles emanating from the assembly.",
      "main_teaching": "Samantabhadra's teaching reveals that, in the Buddic Samādhi, consciousness simultaneously perceives infinite Buddhas in each atom, instant bubble manifestations in all kingdoms, emanations of each body pore and the unification of all the Buddic fields through the three times - demonstrating that Buddha accomplishment is interpenetrating and infinitely expansive, where each part contains the whole in the essential \"equality\" of existence.",
      "miraculous_manifestations": "The Buddha Light: To confirm the teaching, the Buddha emits from its ūrṇā (tuft between the eyebrows) a great ray of light called \"Illumination of the Three Times Focused on All Entrances to the Realm of Dharma.\" This light illuminates all the realms of the universe.",
      "spiritual_progression": "The chapter demonstrates a pedagogical process in three steps: 1) theoretical teaching (samantabhadra). 2) Experienced confirmation (the Buddha's light and the vision of the assembly). 3) Expression of realization (the emanations of the assembly itself, which actively guide other beings).",
      "transition": "The chapter solidifies the cosmological base of the Sutra and prepares the terrain for the journey that will follow, with the introduction of the next Kalyāṇamitra.",
      "unique_elements": "The structure of the ten teachings: The highly structured presentation of the ten points is the backbone of the chapter.",
      "character": {
        "name": "Samantabhadra",
        "teaching": "After the Buddha enters the samādhi \"The Lion's Roar,\" Bodhisattva Samantabhadra takes the lead to explain the depth of this state to the assembly.",
        "description": "",
        "occupation": "Bodhisattva",
        "meaning": "Completely good",
        "local": "JETAVANA, IN ANEMHAPI PARK IN śrāvastī.",
        "summary": "Bodhisattva Samantabhadra recites verses for the bodhisattvas describing the inconceivable interpenetration of phenomena through the buddhas. Additionally, the Buddha, still in samādhi, emanates a ray of light from between his eyebrows so that the bodhisattvas can see these countless buddha realms, and in a state of great joy, the bodhisattvas emanate numerous manifestations.",
        "chapter_file_name": "02 SAMANTABHADRA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1QYST-3K_N-uUSpWA5sa-G5ovCHA-gfU2/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=2",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo2.glb"
      }
    },
    {
      "chapter_number": 3,
      "chapter_title": "Mañjuśrī",
      "name_translation": "Beautiful and auspicious",
      "location": "The narrative begins in Jetavana and follows Mañjuśrī on a journey to the south, to the city of Dhanyākara and the sacred forest of Vicitra Sāla Dhvaja Vyūha nearby.",
      "context": "Mañjuśrī departs from Jetavana with a vast entourage.Śāripututra, seeing the qualities of Mañjuśrī, follows it with 60 newly ordered monks.The main focus then turns to Mañjuśrī's meeting with the population of Dhanyākara, culminating in his interaction with the young Sudhana.",
      "assembly_present": "The Assembly is dynamic, starting with the seventh of Mañjuśrī and the 60 monks.Later, in Dhanyākara, it includes lay people, lay people, and the children and daughters of merchants, notably the young Sudhana, who joins the group.",
      "main_dialogue": "The chapter presents multiple dialogues: 1) śāriputra describes the qualities of Mañjuśrī to the monks.2) The monks express their aspiration to Mañjuśrī.3) Mañjuśrī teaches the monks.4) Sudhana, after hearing Mañjuśrī, follows him and praises him with poetic verses, asking to be taught about the conduct of Bodhisattva.",
      "main_teaching": "Mañjuśrī teaches the 60 monks the \"ten tireless motivations\" to enter Mahāyāna, such as the motivation to serve all Buddhas, seek all Dharmas and purify all the Buddic kingdoms.For Sudhana, he emphasizes that the basis of all Bodhisattva practice is to find and follow without tiring the \"kalyāṇamitras\" (spiritual friends).",
      "miraculous_manifestations": "Śāriputra describes the miraculous manifestations of the body and the way of Mañjuśrī.Upon hearing the teachings of Mañjuśrī, the 60 monks reach a Samādhi that allows them to see all the Buddhas in the ten directions and gain ten thousand types of aspirations and Samādhis.The history of the birth of Sudhana is also miraculous, with treasures and pots of precious substances appearing spontaneously in his home.",
      "spiritual_progression": "The 60 monks reach irreversibility on the way.The crucial point is the awakening of aspiration to lighting in Sudhana, which becomes the conductive wire to the rest of the Sutra.He learns that progression depends on the active search for spiritual guides.",
      "transition": "This chapter serves as the true introduction to the pilgrimage of Sudhana.After inspiring him, Mañjuśrī directs him to find his first kalyāṇamitra, the monk Meghaśrī, in the Sugrīva mountain, in the land of Rāmāvarānta.Sudhana's farewell is marked by tears, showing her deep devotion.",
      "unique_elements": "'- The introduction of the protagonist: This chapter marks the transition from the general scenario to the personal journey of Sudhana.- The concept of Kalyāṇamitra: The importance of the friend or spiritual guide is established as the fundamental principle of the journey.- Poetic Praise: The long and beautiful verses from Sudhana to Mañjuśrī demonstrates the importance of devotion and aspiration on the way.",
      "character": {
        "name": "Manjushri",
        "teaching": "Mañjuśrī teaches the 60 monks the \"ten tireless motivations\" to enter Mahāyāna, such as the motivation to serve all Buddhas, seek all Dharmas and purify all the Buddic kingdoms. For Sudhana, he emphasizes that the basis of all Bodhisattva practice is to find and follow without tiring the \"kalyāṇamitras\" (spiritual friends).",
        "description": "Mañjuśrī departs from Jetavana with a vast entourage.",
        "occupation": "Bodhisattva",
        "meaning": "Beautiful and auspicious",
        "local": "The narrative begins in Jetavana and follows Mañjuśrī on a journey to the south, to the city of Dhanyākara and the sacred forest of Vicitra Sāla Dhvaja Vyūha nearby.",
        "summary": "Through the blessing of the Buddha, śāriputra is able to see Mañjuśrī, who is leaving southern India. Accompanied by his sixty students, he follows Mañjuśrī. He praises Mañjuśrī to his student Sāgarabuddhi. They all go to Mañjuśrī and pay him tribute, and Mañjuśrī teaches them ten motivations. Then Mañjuśrī goes to the Vicitrasāladhvajavyūha forest, near the city of Dhanyākara. Mañjuśrī describes the miracles that occurred at the birth of Sudhana, praises Sudhana and teaches him and others about the nature of the Buddhas. Mañjuśrī part; Sudhana follows him, and in verse praises him and asks for teachings. Mañjuśrī instructed him to develop Bodhisattva's conduct trusting in Kalyāṇamitras.",
        "chapter_file_name": "03 MAÑJUŚRĪ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1KS-LppkNjhv-z3LbrTV3E6PcLPqKBuy9/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=3",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo3.glb"
      }
    },
    {
      "chapter_number": 4,
      "chapter_title": "Meghaśrī",
      "name_translation": "Cloud glory",
      "location": "Mountain Sugrīva, in the land of Rāmāvarānta.",
      "context": "Following the instruction of Mañjuśrī, Sudhana travels to the Sugrīva mountain.He seeks persevering by Meghaśrī for seven days in all directions of the mountain, demonstrating his dedication and determination in the search for a spiritual guide.",
      "assembly_present": "The meeting is focused on Sudhana and Bhikṣu Meghaśrī, who is walking alone in a roller plate.",
      "main_dialogue": "After finding Meghaśrī walking in a plateau, Sudhana prostrates himself and asks the question that will become the pattern on his journey: \"How should a Bodhisattva train in the conduct of a Bodhisattva?\"Meghaśrī praises Sudhana's aspiration, emphasizes the difficulty of the search, and then describes her own realization as an answer.",
      "main_teaching": "The release through full attention in the Buddhas.Meghaśrī is a visionary capacity that allows him, when looking in any direction, to perceive an inconceivable and exponentially growing number of Buddhas, along with their kingdoms, auras, assemblies and distinct teachings.",
      "miraculous_manifestations": "The main manifestation is Meghaśrī's own view.There are no external miracles, but the description of his internal perception: he sees in all ten directions a number of Buddhas that grows from ten to a number equal to atoms in countless Budic kingdoms.He also realizes the distinct qualities of each of these Buddhas.",
      "spiritual_progression": "The teaching radically expands Sudhana's perspective, showing it the vastness of the Buddic universe and the scale of practice.The implicit lesson is that the path of Bodhisattva begins with the ability to visualize and connect with the infinite Buddic field.",
      "transition": "Meghaśrī, in an act of humility, admits that his, although vast, is limited to this portal of Dharma.He acknowledges that other bodhisattvas have even deeper samādhis and directs Sudhana to his next Kalyāṇamitra, the Bhikṣu Sāgaramegha, who resides in the Sāgaramukha district.",
      "unique_elements": "'- The persevering search: Sudhana's seven-day search establishes his determination as a pilgrim.",
      "character": {
        "name": "Meghaśrī",
        "teaching": "The release through full attention in the Buddhas. Meghaśrī is a visionary capacity that allows him, when looking in any direction, to perceive an inconceivable and exponentially growing number of Buddhas, along with their kingdoms, auras, assemblies and distinct teachings.",
        "description": "Following the instruction of Mañjuśrī, Sudhana travels to the mountain Sugrīva.",
        "occupation": "Monk",
        "meaning": "Cloud glory",
        "local": "Mountain Sugrīva, in the land of Rāmāvarānta.",
        "summary": "Sudhana comes to Rāmāvar com and finds the monk Meghaśrī walking on a plateau, on the summit of a mountain. Meghaśrī describes how he can see all tathāgatas in all directions. However, he states that his knowledge is limited and cannot describe the various achievements that allow other bodhisattvas to see all Tathāgatas.",
        "chapter_file_name": "04 MEGHAŚRĪ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1yEATMBo_kjkqgjNKulOmWIUlOCbzg8DV/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=4",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo4.glb"
      }
    },
    {
      "chapter_number": 5,
      "chapter_title": "Sāgaramegha",
      "name_translation": "Ocean cloud",
      "location": "On the ocean coast, in a district called Sāgaramukha.",
      "context": "After contemplating for twelve years the vastness of the ocean, wondering if there was something bigger, Sāgaramegha has a transformative vision that becomes the basis of his teaching. Sudhana finds him and asks a series of poetic questions about how a Bodhisattva advances on the way.",
      "assembly_present": "The Assembly is visionary, composed of mythological beings (nāgas, asuras, etc.) that reverence the cosmic lotus. After his realization, Sāgaramegha also teaches the beings of the ten directions that seek him.",
      "main_dialogue": "Sudhana expresses her aspiration and asks poetic questions about Bodhisattva's journey. Sāgaramegha first praises Sudhana's motivation, describes the prerequisites for aspiration to enlightenment and then narrates the long contemplation of the ocean that culminated in her vision and receipt of the Dharma.",
      "main_teaching": "The release through the contemplation of vastness and the receipt of the Dharma. Sāgaramegha teaches the Dharma portal called \"Eyes that all see\" (All-Seeing Eyes), which was transmitted directly to a Tathāgata that came from a vision. This teaching is so vast that the whole ocean as ink would not be enough to write it.",
      "miraculous_manifestations": "The main manifestation is the vision of a gigantic jewelry lotus arising from the ocean, sustained by asuras and revered by a vast assembly of beings (nāgas, garuḍas, devas, etc.). In the center of the lotus, Sāgaramegha sees a body of Tathāgata, whose form extends to the summit of existence, which then conveys the teaching.",
      "spiritual_progression": "Sudhana learns that profound contemplation of nature can lead to transformative visions and direct receipt of teachings. He understands that even such a deep teaching is just a portal among many, reinforcing the vastness of the path of Bodhisattva.",
      "transition": "Sāgaramegha, as well as his predecessor, recognizes the limitation of his knowledge. He states that he only knows this portal of Dharma and directs Sudhana to his next Kalyāṇamitra, the Bhikṣu Supratiṣṭhita, who resides in Sāgaratīra, on the way to Laṅka.",
      "unique_elements": "Nature contemplation: the use of ocean contemplation as a method to open the mind to the vastness of Dharma.",
      "character": {
        "name": "Sāgaramegha",
        "teaching": "The release through the contemplation of vastness and the receipt of the Dharma. Sāgaramegha teaches the Dharma portal called \"Eyes that all see\" (All-Seeing Eyes), which was transmitted directly to a Tathāgata that came from a vision. This teaching is so vast that the whole ocean as ink would not be enough to write it.",
        "description": "Sudhana finds him and asks a series of poetic questions about how a Bodhisattva advances on the way.",
        "occupation": "Monk",
        "meaning": "Ocean cloud",
        "local": "On the ocean coast, in a district called Sāgaramukha.",
        "summary": "Sudhana meets Sāgaramegha, who describes how, as she concentrated in the ocean and her qualities for twelve years, she saw a Buddha sitting from a precious giant lotus flower with countless deities of various kinds to pay honors to that Buddha, which granted her a teaching called Eyes that see all.",
        "chapter_file_name": "05 SĀGARAMEGHA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1EYvXCd9rENlfN_6k8xgK1Gn9KjNF0pUk/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=5",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo5.glb"
      }
    },
    {
      "chapter_number": 6,
      "chapter_title": "Suprati",
      "name_translation": "Firmly established",
      "location": "Sāgaratīra, in the region of Laṅka.",
      "context": "Sudhana finds supratiṣṭhita not on land, but walking in heaven, like the center of a vast cosmic procession, being revered with offerings by a huge assembly of heavenly and mythological beings who accompany him.",
      "assembly_present": "A vast cosmic assembly that accompanies him in the sky, including: devas, nāgas, kinnaras, maharagas, asuras, haws, yakṣas, rākṣas, gentlemen brahmakāyika and devas śuddhāvāsa, each paying a unique type of tribute.",
      "main_dialogue": "Sudhana, amazed at vision, prostrates himself and asks for teachings. Supratihite explains in detail his release, the \"portal without impediments\", and how, from the realization of the \"presence without substance\", it manifests its miraculous powers to serve all Buddhas and guide beings.",
      "main_teaching": "The release of the \"Unimpeded Gateway) portal. The realization of supratiṣṭhita is the \"light of wisdom called the apex without impediments\", which is based on \"presence without substance\" and gives it uncomposed miraculous powers. This results in the total absence of obstacles to knowing the minds of all beings, the past and the future, and to travel and make offerings to all Buddhas in the universe at one moment.",
      "miraculous_manifestations": "The chapter is a spectacular demonstration of power: - Walk in heaven: supratiṣṭhita walks serenely in heaven.- Powers of transformation: It can become invisible, emanate fire, multiply your body, cross solid objects, and master the elements.- omnipresence: In a single mental moment, he travels to countless Buddic kingdoms in the ten directions to make offerings to all Buddhas simultaneously.",
      "spiritual_progression": "Sudhana learns that spiritual fulfillment completely transcends physical laws. He witnesses a level of power and freedom that demonstrates that for a bodhisattva performed there is no separation between kingdoms, and there are no limits to the ability to perceive reality and serve the Buddhas.",
      "transition": "He humbly admits that he only knows this portal of liberation and cannot understand the conduct of Bodhisattvas with even wider achievements. He then directs Sudhana to his next Kalyāṇamitra: The Dravidian Megha in the city of Vajrapura in the land of Draviḍa.",
      "unique_elements": "Extreme miraculous powers: The chapter offers one of the most vivid and extensive descriptions of psychic powers (Siddhis) in Sutra.",
      "character": {
        "name": "Suprati",
        "teaching": "The liberation of the \"Unimpeded Gateway\" portal. The realization of Supratiṣṭhita is the \"light of wisdom called the apex without impediments,\" which is based on \"presence without substance\" and gives him non-compounded miraculous powers. This results in the total absence of obstacles to knowing the minds of all beings, the past and the future, and to travel and make offerings to all buddhas in the universe in a single moment.",
        "description": "Sudhana seeks Supratiṣṭhita not on land, but walking in heaven, like the center of a vast cosmic procession, being revered with offerings by a huge assembly of heavenly and mythological beings who accompany him.",
        "occupation": "Monk",
        "meaning": "Firmly established",
        "local": "Sāgaratīra, in the region of Laṅka.",
        "summary": "Sudhana seeks Supratiṣṭhita and, finally, sees him walking in the sky accompanied by a vast assembly of various types of deities, which pay him a tribute. Supratiṣṭhita states that he has reached wisdom called the unimpeded apex, so that he knows past lives, all past buddhas, all languages, when guiding beings, and so on, and can perform all kinds of miracles.",
        "chapter_file_name": "06 SUPRATIṢṬHITA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1VwEshXbZ0N1UwJJTx_U1XZC14U1NapKi/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=6",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo6.glb"
      }
    },
    {
      "chapter_number": 7,
      "chapter_title": "Megha",
      "name_translation": "Cloud",
      "location": "The city of Vajrapura, in the land of Draviḍa.",
      "context": "Sudhana finds Megha in a courtyard, sitting on a lion throne, teaching the \"display of the swivel wheel of syllables\" to a ten thousand beings assembly.It represents the mastery of universal communication to guide all beings.",
      "assembly_present": "Initially ten thousand beings.After the manifestation of light, a vast assembly of devas, nāgas, yakṣas and other beings with miraculous powers is attracted and joins the teaching.",
      "main_dialogue": "After Sudhana's question, Megha gets up, completely prostrates herself before Sudhana, and makes offerings to him in an act of reverence to the path of Bodhisattva.He then praises the qualities of a Bodhisattva with many metaphors (earth, ocean, sun) before explaining his own realization.",
      "main_teaching": "The release through the \"Sarasvatī retention power\".This achievement gives Megha the complete knowledge of all languages (divine, human, animals, etc.) in countless kingdoms.He can understand the speech of all three -stroke Buddhas and teach Dharma perfectly adapted to each being.",
      "miraculous_manifestations": "While Megha praises the qualities of a Bodhisattva, a mass of rays of light emanates from his mouth, illuminating a billion worlds.This light attracts a vast assembly of powerful beings (devas, nāgas, etc.) that, when hearing their teaching, become irreversible on the way to enlightenment.",
      "spiritual_progression": "Sudhana learns that Dharma's mastery includes the mastery of communication.True understanding manifests itself as the ability to understand and connect with all beings through their own languages, effectively guiding them to awakening.",
      "transition": "Megha admits that his knowledge is limited to this portal of universal language and cannot understand the entire conduct of the bodhisattvas.He directs Sudhana to find the head of household (Householder) Muktaka, in the city of Vanavāsī.",
      "unique_elements": "'- Prostration of the Master (Megha) before the disciple (Sudhana), a rare act of humility and respect for the way.",
      "character": {
        "name": "Megha",
        "teaching": "The liberation through the \"Sarasvatī retention power.\" This achievement gives Megha the complete knowledge of all languages (divine, human, animal, etc.) in countless realms. He can understand the speech of all buddhas of the three times and teach the Dharma perfectly adapted to each being.",
        "description": "Sudhana finds Megha in a courtyard, sitting on a lion throne, teaching the \"display of the swivel wheel of syllables\" to a ten thousand beings assembly.",
        "occupation": "Grammarian",
        "meaning": "Cloud",
        "local": "The city of Vajrapura, in the land of Draviḍa.",
        "summary": "Sudhana finds Megha teaching on a throne in a courtyard of the city of Vajrapura. Megha descends from his throne and makes many offerings to Sudhana. He praises the bodhisattvas through various analogies, and rays of light shine from his mouth, spreading throughout the universe. Many deities of various types come to hear. Then Megha sits back on his throne and states that he has attained Sarasvatī's retention power, so he knows the tongues of all different types of deities and other beings in all worlds.",
        "chapter_file_name": "07 MEGHA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1dIzDu58w9WJAeZO2OVB1R30Pf9lVzgup/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=7",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo7.glb"
      }
    },
    {
      "chapter_number": 8,
      "chapter_title": "Muktaka",
      "name_translation": "Liberators",
      "location": "The city of Vanavāsī.",
      "context": "Sudhana travels for twelve years, demonstrating extraordinary perseverance until she finally finds Muktaka. He approaches great humility, expressing the joy of the rarity of finding a true Kalyāṇamitra and details his vast aspiration of serving all Buddhas and Bodhisattvas.",
      "assembly_present": "The focus is on the direct interaction between Sudhana and Muktaka and in the internal view that Sudhana has of countless Buddhas in Muktaka's body.",
      "main_dialogue": "Sudhana makes a long and detailed supplication on her aspiration. In response, Muktaka enters Samādhi. When emerging, he explains that Sudhana's vision was not an external event, but a manifestation of Sudhana's own mind, blessed by the power of her practice. He uses the analogies of the dream, reflection and echo to illustrate this point.",
      "main_teaching": "The release of \"Unimpeded Display) exposure. The central lesson, revealed through a miraculous view and direct instruction, is that the whole spiritual journey, including the visions of Buddhas and Budic kingdoms, is a manifestation and blessing of the practitioner's own mind. He teaches that the Buddhas do not come from elsewhere, nor the practitioner goes elsewhere; Perception is like a dream or a reflection. The key is to cultivate your mind.",
      "miraculous_manifestations": "Upon entering Samādhi, from the purified body of Muktaka, Sudhana witnesses an inconceivable manifestation: countless Búdic kingdoms in the ten directions, each with his Buddha, assembly, teachings, and the full life cycle of his Buddhas - from birth to Parinirvāṇa - all happening simultaneously, without obstruction, within the body of Muktaka.",
      "spiritual_progression": "Sudhana receives one of the deepest teachings so far: the nature of spiritual reality as a projection of the mind. He learns that the journey is not about traveling to external kingdoms, but about purifying one's mind to the point that it can reflect Buddha reality, marking a transition from the external search to internal fulfillment.",
      "transition": "Muktaka, following the pattern, admits that he only knows this release and cannot understand the conduct of the bodhisattvas whose wisdom is like an ocean. He directs Sudhana to his next guide: Bhikṣu Sāgaradhvaja, who resides in Milapharaṇa, at the tip of Jambudvīpa's continent.",
      "unique_elements": "Twelve-year journey: The long duration of Sudhana's search emphasizes the importance of perseverance.",
      "character": {
        "name": "Muktaka",
        "teaching": "The liberation of \"Unimpeded Display.\" The central lesson, revealed through a miraculous vision and direct instruction, is that the entire spiritual journey, including the visions of buddhas and buddha realms, is a manifestation and blessing of the practitioner's own mind. He teaches that the buddhas do not come from elsewhere, nor does the practitioner go elsewhere; perception is like a dream or a reflection. The key is to cultivate one's mind.",
        "description": "Countless buddhas, their deeds, their realms, and their disciples become visible within his body.",
        "occupation": "Meditation community",
        "meaning": "Liberators",
        "local": "The city of Vanavāsī.",
        "summary": "After twelve years, Sudhana arrives at Vanavāsī and finds Muktaka. Muktaka enters a state of meditation through the retention power called the Assembly of all Buddha Realms, and countless buddhas, their deeds, their realms, and their disciples become visible within his body. He leaves his meditation and states that through the liberation called the unimpeded display, he can see any buddha in any realm or time he wishes.",
        "chapter_file_name": "08 MUKTAKA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1_-jrp0CqvsJ5fuHpQkh2Zd7tfrPq_CYy/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=8",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo8.glb"
      }
    },
    {
      "chapter_number": 9,
      "chapter_title": "Sāgaradhvaja",
      "name_translation": "Ocean flag",
      "location": "Milapharaṇa, at the tip of the continent of Jambudvīpa.",
      "context": "Sudhana finds Sāgaradhvaja sitting in deep meditation, immobile and without breathing. He remains like this for six months and six days, while Sudhana watches him patiently. During this period, the body of the monk becomes the epicenter of an extraordinary cosmic display of illuminated activity, emanating the ten perfections (pāramitās) of each part of his body.",
      "assembly_present": "The assembly is entirely visionary and multifaceted, emanating from Sāgaradhvaja's own body. Includes traders practicing generosity, wise kings, ṛṣis, nāgas, asuras, śrāvakas, and even emanations of suns, moons and their own Buddhas.",
      "main_dialogue": "The dialogue occurs only after Sāgaradhvaja emerges from its six -month meditation. Sudhana, marvelously, asks Samādhi's name. Sāgaradhvaja explains that it is the \"perfection of wisdom called the complete view of the realization of equanimity\" and, like others, admits only to know this portal.",
      "main_teaching": "The release of the \"complete view of the realization of equanimity\". The teaching is not verbal, but a direct demonstration through its Samādhi. It manifests, from each part of his body, emanations that correspond to the practice and the result of the ten perfections, showing how the realization of a Bodhisattva actively benefits all beings.",
      "miraculous_manifestations": "This chapter contains one of the most elaborate descriptions of Sutra manifestations. Emanating from specific parts of the body of Sāgaradhvaja, Sudhana witnesses the ten perfections in action: generosity (dāna) of the feet, discipline (śīla) of the knees, patience (kṣānti) of the navel, diligence (vīrya) of the sides, meditation (dhyāna) of the chest, and so on, culminating with emanations of their bodies of TathāgataHead, raining Dharma over all.",
      "spiritual_progression": "Sudhana learns through direct observation how a single being manifests itself as a universal and multifaceted compassionate activity. The long duration of its observation symbolizes the patience and devotion necessary to understand the depth of the conduct of a Bodhisattva.",
      "transition": "Sāgaradhvaja, when emerging, confirms the name of his practice, but humbly admits that he only knows this portal. He directs Sudhana to his next guide, the Upāsikā (lay practitioner) āśā, in the city of Mahāprabhāsa, in a land called Samudravetāḍī.",
      "unique_elements": "Specific body emanations: The detailed correlation between body parts and ten perfections is unique, transforming the body of the meditator into a cosmic mandala.",
      "character": {
        "name": "Sāgaradhvaja",
        "teaching": "The release of the \"complete view of the realization of equanimity\". The teaching is not verbal, but a direct demonstration through its Samādhi. It manifests, from each part of his body, emanations that correspond to the practice and the result of the ten perfections, showing how the realization of a Bodhisattva actively benefits all beings.",
        "description": "Sudhana finds Sāgaradhvaja sitting in deep meditation, immobile and without breathing.",
        "occupation": "Monk",
        "meaning": "Ocean flag",
        "local": "Milapharaṇa, at the tip of the continent of Jambudvīpa.",
        "summary": "Sudhana reaches Milapharaṇa and finds the monk Sāgaradhvaja sitting in meditation at the end of a meditation catwalk. He is emanating various types of beings, Bodhisattvas and Buddhas from different parts of his body, and these emanations are spreading throughout the Buddic kingdoms, performing various types of activities. Sudhana sits before him for six months and six days until Sāgaradhvaja rises from her Samādhi.",
        "chapter_file_name": "09 SĀGARADHVAJA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/10iJh-r5hmq5Dtgx8VnYKWfaPc25d8NHT/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=9",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo9.glb"
      }
    },
    {
      "chapter_number": 10,
      "chapter_title": "WING",
      "name_translation": "Hope",
      "location": "Samantavyūha Park in the city of Samudravetāḍī.The park is a direct manifestation of the mind of āśā, described as an inconceivable magnificence paradise, with ten trillion jewelry mansions, one hundred thousand kūṭāgāras gold, thousands of air palaces and a million fragrant lakes with divine sandal.In the center, the Vicitra Dhvaja Palace is raised, made of ocean jewelry and eggplant.",
      "context": "Sudhana arrives at this spectacular park and finds āśā sitting on a golden throne, adorned with heavenly jewelry.It is revered by an assembly of quintillions of beings of all classes, who come from ten directions to honor it and receive their teachings.",
      "assembly_present": "Quintillions of beings, including mahābrahmās, devids of all kingdoms of desire, nāgas, yakṣas, asuras, humans and others.Notably, 84,400,000 quintalions of beings with the same level of conduct as āśā are also present, demonstrating the vastness of their influence.",
      "main_dialogue": "Sudhana asks for teachings.In response to her question about when she will reach the final illumination, āśā responds with a famous and long enumeration of inconceivably large numbers (Ayuta, Niyuta, AnabhilāPyānabhilāpya) to illustrate that her aspiration is infinite and is not content with finite goals.",
      "main_teaching": "The release of the \"Blessed Blesser Banner of Bliss Without Sorrow).Its practice is the embodiment of truly universal bodhisattva aspiration and without exceptions.She teaches that the motivation of a Bodhisattva should not merely guide a finite number of beings or purify a finite number of kingdoms, but should cover the totality of all beings in all kingdoms, without exception, postponing the final lighting itself until all others are saved.",
      "miraculous_manifestations": "The park itself is the main manifestation.The simple view of āśā cures instantly all diseases and removes the mental afflictions of beings, establishing them in irreversibility.Tathāgatas of the ten directions appear constantly in their presence.From their pores emanate clouds of jewelry, and his voice echoes simultaneously in all languages, adapting perfectly to the needs of each being.",
      "spiritual_progression": "Sudhana learns the true scale of bodhisattva's compassion and aspiration.He understands that the way is not about reaching a finite personal goal, but about an infinite and unshakable commitment to the well-being of all beings without exception.",
      "transition": "Āśā, with humility, declares that he knows this release only and cannot understand the conduct of the bodhisattvas which are like oceans of merit.She directs Sudhana to her next guide, ṛṣi BHṣṣmottaranirghoṣa in the Nālayu forest.",
      "unique_elements": "'- truly infinite aspiration: the emphasis on the inclusion of all beings, without exception, as the core of practice.",
      "character": {
        "name": "Wing",
        "teaching": "The release of the \"Blessed Blesser Banner of Bliss Without Sorrow). Its practice is the embodiment of truly universal bodhisattva aspiration and without exceptions. She teaches that the motivation of a Bodhisattva should not merely guide a finite number of beings or purify a finite number of kingdoms, but should cover the totality of all beings in all kingdoms, without exception, postponing the final lighting itself until all others are saved.",
        "description": "Āśā is sitting in a large throne made of the essence of gold, adorned with a crown of pearls and precious jewelry that emit rays of glorious light. Her arms are decorated with gold bracelets and she wears dark blue pendant earrings, all bright and radiant.",
        "occupation": "Lay devotee",
        "meaning": "Hope",
        "local": "Samantavyūha Park in the city of Samudravetāḍī. The park is a direct manifestation of the mind of āśā, described as an inconceivable magnificence paradise, with ten trillion jewelry mansions, one hundred thousand kūṭāgāras gold, thousands of air palaces and a million fragrant lakes with divine sandal. In the center, the Vicitra Dhvaja Palace is raised, made of ocean jewelry and eggplant.",
        "summary": "Sudhana arrives at the Samantavyūha Park, which is miraculously beautiful and made of precious substances. Upāsikā āśā is sitting on a throne within a magnificent palace, with a vast number of beings of various types to pay tribute to it. She tells Sudhana that she reached Bodhisattvica release, called Blessed Blessed Standard, and tells her past as a student of numerous Buddhas. It emphasizes how the bodhisattvas are dedicated to the well-being of all beings.",
        "chapter_file_name": "10 ĀŚĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1i6Gx_VjZXE64pIfHIDJzxsmZrKbnJmXs/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=10",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo10.glb"
      }
    },
    {
      "chapter_number": 11,
      "chapter_title": "BHṣṣMottara Nirghoṣa",
      "name_translation": "Supreme and terrible sound",
      "location": "An idyllic forest in the land of Nālayu.",
      "context": "Sudhana seeks and finds ṛṣi bhṣmottara nirghoṣa, an ascet with tangled hair and tree bark robes, meditating in a Ashram.The meeting is witnessed by ten thousand young Blahs.Sudhana, recognizing the importance of Kalyāṇamitra as a portal for omniscience, prostrates and asks for instruction.",
      "assembly_present": "Ten thousand young Brahmin, who act as an assembly that recognizes and validates the aspiration of Sudhana, amplifying the importance of his search.",
      "main_dialogue": "Central dialogue unfolds into three parts: 1) Sudhana's question about the conduct of the bodhisattva.2) BHṣMottara Nirghoṣa's answer, which first heads for the ten thousand young Brahmin to praise Sudhana's noble aspiration.3) The young Brahon, in turn, cover sudhana of flowers and reverence him, prophesying that he will become a protector for all beings.",
      "main_teaching": "The release of the bodhisattva called \"the banner of invincibility.\"This teaching is not verbally transmitted, but through a direct visionary experience, demonstrating that true invincibility comes from the direct perception of Buddha reality.",
      "miraculous_manifestations": "The main manifestation occurs when ṛṣi extends his right hand and touches Sudhana's head.This touch induces a deep and transformative vision: Sudhana perceives instantly countless Búdic kingdoms in the ten directions, sees himself in the presence of all the Buddhas of these kingdoms, hears his teachings, understands his various prayers and witnesses his emanations.This experience unfolds over time periods that seem to extend to countless kalpas.",
      "spiritual_progression": "Through the blessing of ṛṣi, Sudhana reaches multiple Samādhis, including \"the essence of the sun\" and \"the domain of the precious and incessant knowledge of the three times.\"He gains direct lighting on the nature of phenomena and the vastness of Buddic rule.Upon returning to normal consciousness, he retains the memory of experience as a blessing of Kalyāṇamitra.",
      "transition": "BHṣṣmottara nirghoṣa humbly admits that you know this release only and cannot understand all the most advanced Bodhisattvas practices.He directs Sudhana to his next guide, the Bramane Jayoṣmāyatana, in the land of ṣṣāṇa.",
      "unique_elements": "The use of physical touch as a catalyst for a deep spiritual view.The radical experience of time expansion, where Kalpas of practice are experienced in a moment.The role of the Assembly of Bramanes in recognizing and celebrating the aspiring journey.",
      "character": {
        "name": "BHṣṣmottaranirghoṣa",
        "teaching": "The liberation of the bodhisattva called \"the banner of invincibility.\" This teaching is not verbally transmitted, but through a direct visionary experience, demonstrating that true invincibility comes from the direct perception of Buddha reality.",
        "description": "Sudhana seeks and finds ṛṣi bhṣmottara nirghoṣa, an ascet with tangled hair and tree bark robes, meditating in a Ashram.",
        "occupation": "Seer",
        "meaning": "Supreme and terrible sound",
        "local": "An idyllic forest in the land of Nālayu.",
        "summary": "Sudhana arrives in Nālayu and finds ṛṣi bhṣmottaranirghoṣa, along with ten thousand young students, in an ashram in a miraculously beautiful forest. BHṣṣmottaranirghoṣa speaks to their students from the greatness of Sudhana, and they make offerings. BHṣṣmottaranirghoṣa tells Sudhana that he reached the Bodhisattvic liberation called the banner of being invincible to others.",
        "chapter_file_name": "11 BHĪṢMOTTARANIRGHOṢA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1SLw127gIGv-I73p-U54V-BkfD9WGWSNc/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=11",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo11.glb"
      }
    },
    {
      "chapter_number": 12,
      "chapter_title": "Jayoṣmāyatana",
      "name_translation": "Luminous Triumph",
      "location": "The land of ṣṣāṇa, where it is positioned between a mountain of fire and a cliff with a razor path.",
      "context": "Sudhana finds Jayoṣmāyatana engaged in terrifying ascetic practices. When asking for instruction, Sudhana receives a shocking order: to purify his conduct of Bodhisattva, he must climb the razor path and throw himself into the great fire. This challenge serves as a fundamental test of your faith in Kalyāṇamitra.",
      "assembly_present": "A massive and diverse assembly of heavenly and mythological beings that appear to validate Kalyāṇamitra. This assembly is not physically present at the beginning, but manifests itself to resolve Sudhana's crisis of faith, playing a crucial role in its progression.",
      "main_dialogue": "The chapter is structured around the Sudhana test: 1) Jayoṣmāyatana emits the order to climb the razors and jump into the fire. 2) Sudhana doubts, fearing that the Bramane is a disguised māra. 3) The vast heavenly assembly intervenes, with each group of beings offering its testimony to reaffirm Sudhana's faith. 4) Sudhana regrets her doubt, performs the act and expresses her astonishment with the pleasant experience.",
      "main_teaching": "The release of the bodhisattva called \"the incessant domain\". The teaching is transmitted through radical physical proof. By overcoming his fear and doubt, Sudhana learns that the instructions of a true, even if they seem destructive guide lead to transcendence. Pain becomes ecstasy, demonstrating that trust and delivery purify perception.",
      "miraculous_manifestations": "The main manifestation is the transformation of experience. By jumping to the fire, Sudhana discovers that the touch of flames and razors is pleasant. Moreover, when Sudhana's faith hesits, a vast heavenly assembly (including ten thousand brahmās, māras, and kings of all six kingdoms of desire, along with Nāgas, Yakṣas, Asuras, etc.) appears in heaven to witness in favor of Jayoṣmāyatana, each group explaining how the austerities of the wise man benefited them and guided them to the Dharma.",
      "spiritual_progression": "Sudhana goes through a decisive test of trust. In following the apparently irrational instructions, he transcends the fear of pain and death. This act of faith leads him to reach two new Samādhis of Bodhisattva: Samādhi called \"completely stable\" by jumping, and Samādhi \"realizing the ecstasy of peace\" when touching the fire. He learns the lesson that the true nature of phenomena can be radically different from appearances.",
      "transition": "Jayoṣmāyatana, claiming to know only this release, directs Sudhana to her next guide: Maitrayaṇī, the daughter of King Siṃhaketu, in the city of Siṃha-Vijṛmbhita.",
      "unique_elements": "The use of an extreme physical challenge as a faith test. The intervention of a heavenly assembly to resolve the protagonist's doubt. Paradoxical transformation of ecstasy pain as the climax of realization.",
      "character": {
        "name": "Jayoṣmāyatana",
        "teaching": "The liberation of the bodhisattva called \"the incessant domain\". The teaching is transmitted through radical physical proof. By overcoming his fear and doubt, Sudhana learns that the instructions of a true, even if they seem destructive guide lead to transcendence. Pain becomes ecstasy, demonstrating that trust and delivery purify perception.",
        "description": "Sudhana finds Jayoṣmāyatana engaged in terrifying ascetic practices.",
        "occupation": "Brahon",
        "meaning": "Luminous Triumph",
        "local": "The land of ṣṣāṇa, where it is positioned between a mountain of fire and a cliff with a razor path.",
        "summary": "Sudhana finds Brahumne Jayoṣmāyatana performing the ascetic practice of sitting under a cliff surrounded by four bonfires and under the sunny sun. He tells Sudhana that if he rises to the top of the cliff above and jumping into the fire, he will have pure conduct. Upon hearing this, Sudhana has doubts about Jayoṣmāyatana, but they appear deities in the sky describing how Jayoṣmāyatana asceticism has benefited them on the way to Budeity.",
        "chapter_file_name": "12 JAYOṢMĀYATANA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/18AH15IUSQvMfcxtHadArTG4urbCptbjC/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=12",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo12.glb"
      }
    },
    {
      "chapter_number": 13,
      "chapter_title": "Maitrayaṇī",
      "name_translation": "Female friendship",
      "location": "Vairocana-Garbha Palace (\"Vairocana Lighting Matrix) in the city of Siṃha-Vijṛmbhita.",
      "context": "Sudhana arrives at an inconceivable magnificence palace, with crystal floors and sparkling pillars. There he finds Maitrayaṇī teaching Dharma to a vast crowd that gathered to hear her, accompanied by his sequin of five hundred maiden.",
      "assembly_present": "Hundreds of thousands of people from the city and surroundings, as well as a sequel of five hundred maidens that accompany Maitrayaṇī.",
      "main_dialogue": "Sudhana asks for instruction. Instead of a verbal response, Maitrayaṇī commands him, \"Noble, look at the display of my residence!\" After vision, she explains that this is the \"complete display\" and that, from it, she dominated a power of retention (Dhāraṇī) that contains countless Dharma portals, which she then lists in a long, comprehensive list.",
      "main_teaching": "The portal for the perfection of wisdom called \"the full display\". This teaching is a direct experience that reveals how a Kalyāṇamitra can contain and reflect the entire Dharma, serving as a portal for countless other teachings.",
      "miraculous_manifestations": "The palace itself is the manifestation. Upon being instructed to look, Sudhana sees in every pillar, wall, mirror and jewel of the palace the reflexes of the whole life cycle of all the Buddhas of the universe - from her first aspirations, to her practices, to lighting and Parirvāṇa. Everything is reflected simultaneously everywhere, as the sky is reflected on the surface of a clear lake.",
      "spiritual_progression": "Sudhana learns that a physical environment can be a living mandala, a direct reflection of the illuminated mind of a guide. By witnessing the multitude of teachings contained in one vision, his own mind is expanded and he reaches the power of retention called \"complete portals\", integrating the understanding of multiple ways.",
      "transition": "Maitrayaṇī humbly states that he only knows this teaching of \"complete display\" and directs Sudhana to his next guide, Bhikṣu Sudarśana, which resides in the land of Trinayana.",
      "unique_elements": "The use of architecture as a teaching of Dharma, where the palace acts as a cosmic mirror. The transmission of teaching through direct vision instead of words. The long and exhaustive list of \"Dharma portals\" that demonstrates the vastness contained in a single achievement.",
      "character": {
        "name": "Maitrayaṇī",
        "teaching": "The portal for the perfection of wisdom called \"the full display.\" This teaching is a direct experience that reveals how a kalyāṇamitra can contain and reflect the entire Dharma, serving as a portal for countless other teachings.",
        "description": "Sudhana arrives at an inconceivable magnificence palace, with crystal floors and sparkling pillars.",
        "occupation": "Girl",
        "meaning": "Female friendship",
        "local": "Vairocana-Garbha Palace (\"Vairocana Lighting Matrix) in the city of Siṃha-Vijṛmbhita.",
        "summary": "Sudhana meets Princess Maitrayaṇī with an entourage of five hundred maidens in a miracle palace. She instructs Sudhana to look around the palace, and he sees countless buddhas in each object. She tells Sudhana that she has reached the entrance portal to the perfection of wisdom called the full display of memory.",
        "chapter_file_name": "13 MAITRAYAṆĪ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1iOVZZm6vzqPfAwVpjr5z7XOf7RiqlJbz/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=13",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo13.glb"
      }
    },
    {
      "chapter_number": 14,
      "chapter_title": "SUDARśANA",
      "name_translation": "Beautiful to see",
      "location": "A dense forest in the land of Trinayana.",
      "context": "Sudhana finds the Bhikṣu Sudarśana, a young monk who, although newly ordered in this life, has the perfect physical appearance of a large being, with all the larger and smaller brands of a Buddha. He is engaged in a meditative walk (Caṅkrama), and all his being and environment are a manifestation of his deep achievement.",
      "assembly_present": "A vast assembly of heavenly beings (devas, nāgas, yakṣas, gandharvas, etc.) who are not mere spectators, but active participants, serving and honoring each movement of sudaśana, transforming their meditative walk into a cosmic procession.",
      "main_dialogue": "Sudhana, amazed, asks for instruction. Sudarśana explains that, although young, he practiced celibacy in the presence of a number of Buddhas equal to the 38 -river grains of ganges. He details as, from a single aspiration, he can see simultaneously countless Búdic kingdoms, receive the rain from countless Buddhas and purify all fields of practice.",
      "main_teaching": "The release of the bodhisattva called the \"wisdom lamp that is never extinguished.\" The teaching demonstrates how a single aspiration, maintained with dedication through countless lives, can unify practice and culminate in a simultaneous view of all Búdic kingdoms, teachings and conduct.",
      "miraculous_manifestations": "The body of Sudarśana is the main manifestation, displaying all the marks of the physical perfection of a Buddha. His meditative walk is a cosmic event: devoes of all classes serve him, holding lotus to his feet, illuminating his way, and causing raining flowers and perfumes. Each step of him is an act that purifies Buddic kingdoms and benefits beings.",
      "spiritual_progression": "Sudhana learns about the accumulated power of continuous practice over countless ages. He witnesses how spiritual fulfillment can manifest himself physically, even in the smallest details, and how a single focused aspiration can include all of Bodhisattva's practice, transcending time.",
      "transition": "Sudaśana, with humility, states that he knows only this release and directs Sudhana to find his next guide, the boy Indriyeśvara, in the city of Sumukha, in the land of śramaṇa Maṇḍala.",
      "unique_elements": "The detailed description of the monk's body with the marks of a Buddha. The power of meditative walk as a form of cosmic practice. The idea that a single aspiration can contain and manifest the practice of countless kalpas.",
      "character": {
        "name": "SUDARśANA",
        "teaching": "The liberation of the bodhisattva called the \"wisdom lamp that is never extinguished.\" The teaching demonstrates how a single aspiration, maintained with dedication through countless lives, can unify practice and culminate in a simultaneous vision of all buddha realms, teachings, and conduct.",
        "description": "Standing meditation in the forest",
        "occupation": "Mendicant",
        "meaning": "Beautiful to see",
        "local": "A dense forest in the land of Trinayana.",
        "summary": "After a long search, Sudhana finds the monk Sudarśana assisted by devas while practicing meditation walking in a forest. He tells Sudhana that during his life he was a student of numerous buddhas for vast periods of time and perceives countless buddhas while practicing his meditation walking. However, his knowledge is limited to this bodhisattvic liberation called the wisdom lamp that never extinguishes.",
        "chapter_file_name": "14 SUDARŚANA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1dMKRZBDONzsv_qoP2fNLtpaIs1hH_pdY/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=14",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo14.glb"
      }
    },
    {
      "chapter_number": 15,
      "chapter_title": "INDRIYEśVARA",
      "name_translation": "Lord of Faculties",
      "location": "The confluence of rivers in the city of Sumukha, in the land of Śramaṇa-maṇḍala.",
      "context": "Guided by devas, Sudhana finds her next master, who is surprisingly a child, Inderiyeśvara, playing in the sand with ten thousand other boys. He represents wisdom that transcends age and form, demonstrating that realization can manifest in any being, and that worldly knowledge can be a portal for the transcendent.",
      "assembly_present": "Ten thousand children playing in the sand, along with devas, nāgas, yakṣas and gandharvas who watch from the heavens and guide Sudhana to the boy.",
      "main_dialogue": "Indriyeśvara explains that it was Mañjuśrī himself who taught him writing and mathematics, allowing him to master all the arts and crafts. He then recites the long list of numerical names and uses this count to analyze the mound of sand and, by extension, the vastness of all kingdoms, kalpas, Buddhas and beings in ten directions.",
      "main_teaching": "The portal of wisdom called \"clairvoyance in all arts\". This teaching reveals that a Bodhisattva can master all forms of worldly knowledge-from mathematics and engineering to medicine and agriculture-and use them as a skillful means of guiding beings. The teaching culminates in a lesson on Bodhisattvas mathematics that expands the mind to conceive of infinity.",
      "miraculous_manifestations": "The main manifestation is the demonstration of the bodhisattvas' counting system. Indriyeśvara lists an exponential series of names for inconceivably large numbers (ayuta, niyuta, etc., up to anabhilāpyānabhilāpya). Then he applies this mathematics to calculate the exact number of sand grains in a gigantic hill, demonstrating the ability of his wisdom to encompass and measure the vastness of the universe.",
      "spiritual_progression": "Sudhana learns that wisdom is not limited to purely spiritual concepts, but can cover all areas of knowledge. The lesson on inconceivable mathematics radically expands its conception of infinity and its understanding of a bodhisattva mind of the mind of understanding the totality of existence.",
      "transition": "Indriyeśway, humbly admits that you only know this portal of knowledge of all phenomena and cannot understand the conduct of more advanced Bodhisattvas. He then directs Sudhana to the city of Samudra-Pratiṣṭhāna to find Upāsikā (lay practitioner) Prabhūtā.",
      "unique_elements": "The use of a child like kalyāṇamitra. The integration of secular knowledge (mathematics, engineering, etc.) with spiritual wisdom. The long and impressive enumeration of inconceivable numbers as a teaching method to expand the mind.",
      "character": {
        "name": "INDRIYEśVARA",
        "teaching": "The portal of wisdom called \"clairvoyance in all arts.\" This teaching reveals that a bodhisattva can master all forms of worldly knowledge—from mathematics and engineering to medicine and agriculture—and use them as skillful means for guiding beings. The teaching culminates in a lesson on bodhisattva mathematics that expands the mind to conceive of infinity.",
        "description": "Colleges Master",
        "occupation": "Boy",
        "meaning": "Lord of Colleges",
        "local": "The confluence of rivers in the city of Sumukha, in the land of śramaṇa-maala.",
        "summary": "Sudhana finds Indriyeśvara playing in the sand with another ten thousand children. Indriyeśvara tells Sudhana that he was a student of Mañjuśrī and has mastered all kinds of branches of knowledge. In particular, he reports at length on the enumeration system that the bodhisattvas use. However, his knowledge is limited to this portal called the wisdom that has clairvoyance in all crafts.",
        "chapter_file_name": "15 INDRIYEŚVARA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/17_oNk0Fqy0SS8ZYX9S5nogGaTzrrQxmx/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=15",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo15.glb"
      }
    },
    {
      "chapter_number": 16,
      "chapter_title": "PRABHŪTĀ",
      "name_translation": "Abundant",
      "location": "A house in the city of Samudra-Pratiṣṭhāna.",
      "context": "Sudhana finds Prabhūtā, a young maiden of stunning beauty, sitting in a house that, while simple, can accommodate an infinite number of beings. She has nothing but a single small pot, which proves to be an inexhaustible treasure of generosity. She is accompanied by ten thousand maidens with qualities of apsarās.",
      "assembly_present": "At first, ten thousand maidens who are emanations of her own practice. Later, countless beings from all ten directions, attracted by her past prayers, arrive to receive her offerings.",
      "main_dialogue": "Prabhūtā explains to Sudhana that she, along with her entourage, shares the same conduct, merit, and aspiration. She describes how, from her small pot, she can feed and provide for all beings in the universe. She states that the food from her pot is so powerful that it allows śrāvakas, pratyekabuddhas, and bodhisattvas in their last life to reach their respective illuminations.",
      "main_teaching": "The liberation of the bodhisattva called \"the incessant display of the Treasury of Merit.\" This teaching demonstrates the power of unlimited generosity, showing that the merit of a bodhisattva can manifest as an inexhaustible source that satisfies all the physical and spiritual needs of all beings without ever being depleted.",
      "miraculous_manifestations": "The main manifestation is the small pot. From this single container, Prabhūtā materializes any kind of food, drink, seat, clothing, jewelry, or other item desired to fully satisfy countless beings who come from all directions. The pot never empties. Additionally, the fragrances that emanate from her assistants pacify everyone's minds in the city, eliminating anger, greed, and jealousy.",
      "spiritual_progression": "Sudhana learns that the merit accumulated through generosity is truly inexhaustible and that external simplicity may contain unlimited internal power. He witnesses how active compassion not only relieves material suffering but also serves as a direct catalyst for the illumination of others.",
      "transition": "Prabhūtā, like the others, admits that she only knows this portal of inexhaustible merit and directs Sudhana to his next guide, the householder Vidvān, in the city of Mahāsaṃbhava.",
      "unique_elements": "The contrast between the simple appearance (a young maiden with a small pot) and the infinite miraculous power. The pot as a symbol of the inexhaustible generosity of a bodhisattva. The direct connection between the act of giving (food) and the ability to lead others to final illumination.",
      "character": {
        "name": "Jayoṣmāyatana",
        "teaching": "The liberation of the bodhisattva called \"the incessant display of the Treasury of Merit.\" This teaching demonstrates the power of unlimited generosity, showing that the merit of a bodhisattva can manifest as an inexhaustible source that satisfies all the physical and spiritual needs of all beings without ever being depleted.",
        "description": "Sudhana finds Prabhūtā, a young maiden of stunning beauty, sitting in a house that, while simple, can accommodate an infinite number of beings.",
        "occupation": "Lay woman",
        "meaning": "Abundant",
        "local": "A house in the city of Samudra-Pratiṣṭhāna.",
        "summary": "Sudhana encontra a jovem Prabhūtā em uma casa maravilhosa, vestindo um simples manto branco e sem jóias, com apenas um pequeno pote diante de si e nenhuma outra provisão em sua casa. Dez mil belas donzelas estão presentes como suas assistentes. Ela diz a Sudhana que alcançou a liberação bodhisattvica chamada a exibição incessante do tesouro do mérito. Através disso, ela é capaz de fornecer a incontáveis seres, em todas as direcções, tudo o que desejarem do seu pequeno pote.",
        "chapter_file_name": "16 PRABHŪTĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1w4KsT08gEWVgqk8rm13D6t4I_pLSVLNY/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=16",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo16.glb"
      }
    },
    {
      "chapter_number": 17,
      "chapter_title": "Vidvān",
      "name_translation": "Wise",
      "location": "A crossroads in the center of Mahāsaṃbhava.",
      "context": "Sudhana finds Vidvān sitting on a magnificent jeweled throne at a busy crossroads, surrounded by a retinue of heavenly musicians and beings that surpass the beauty of devas and humans. He personifies generosity manifested through the power of mind and pure aspiration.",
      "assembly_present": "Thousands of petitioners of all origins that come to seek the help of Vidvān, as well as a sequino of five thousand musicians and ten thousand beings with superhuman qualities that serve and participate in the practice of generosity.",
      "main_dialogue": "After Sudhana expresses her vast aspiration to benefit all beings, Vidvān praises him and then demonstrates his power. He meets the needs of all who come and then teach them Dharma in a way that relates directly to what they received. For example, to those who received food, he teaches about the \"food of wisdom\"; To those who received carriages, he teaches about Mahāyāna, the \"great vehicle\".",
      "main_teaching": "The release of the bodhisattva called \"the merit that arises from the treasure of the mind.\" This teaching demonstrates the power to manifest all material requirements directly from heaven, simply through the power of mind and aspiration. Vidvān uses this ability to meet the needs of all beings, and since his material needs are met, he teaches them the Dharma, adapting the message to guide them to illumination.",
      "miraculous_manifestations": "The main manifestation is Vidvān's power to materialize objects from the sky. By simply looking upward, he causes a rain of infinite varieties of foods, beverages, clothes, jewelry, and any other objects that approaching beings desire. These objects appear directly in their hands, simultaneously satisfying countless supplicants.",
      "spiritual_progression": "Sudhana learns that the generosity of a Bodhisattva is not limited by physical resources. Through the power of mind and merit, the ability to give is infinite. He also learns a skillful teaching method: first satisfy the worldly needs of beings to open their hearts and minds for spiritual teaching.",
      "transition": "Vidvān humbly states that he knows this release only and cannot understand the conduct of the bodhisattvas which are like an ocean of merit. He directs Sudhana to the city of Siṃhapota to find his next guide, the patron of Dharma Ratnacūḍa.",
      "unique_elements": "The manifestation of material objects directly from heaven as a result of mental power and merit. The teaching method that directly connects the satisfaction of material needs with a corresponding spiritual teaching. The practice of generosity in a public and urban scenario (a crossroads).",
      "character": {
        "name": "Vidvān",
        "teaching": "The liberation of the bodhisattva called \"the merit that arises from the treasure of the mind.\" This teaching demonstrates the power to manifest all material requirements directly from heaven, simply through the power of mind and aspiration. Vidvān uses this ability to meet the needs of all beings, and since his material needs are met, he teaches them the Dharma, adapting the message to guide them to illumination.",
        "description": "Sudhana finds Vidvān sitting on a magnificent throne of jewelry in a busy crossroads, surrounded by a sectional of heavenly musicians and beings that surpass the beauty of Devas and Humans.",
        "occupation": "Householder",
        "meaning": "Wise",
        "local": "A crossroads in the center of Mahāsaṃbhava.",
        "summary": "Sudhana finds Vidvān on a throne on a platform at the crossroads in the city center. Vidvān tells Sudhana that he has reached Bodhisattvic release called the merit that arises from the treasure of mind. Therefore, he is able to provide beings with everything they desire, and he brought his entourage of ten thousand musicians to the path of enlightenment. Sudhana sees countless beings arrive. When Vidvān looks to heaven, everything beings desire to go down to the hands of Vidvān, and he gives them.",
        "chapter_file_name": "17 VIDVĀN Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/10RTf1Bcc27ITsOR6J22E3e3bNX77nyhb/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=17",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo17.glb"
      }
    },
    {
      "chapter_number": 18,
      "chapter_title": "Ratnacūḍa",
      "name_translation": "Jewelry",
      "location": "The city of Siṃhapota, in a busy market, and its ten -story home.",
      "context": "Sudhana finds Ratnacūḍa and is invited to her home, a magnificent ten -story structure, which acts as a three -dimensional mandala of the Bodhisattva Journey. Each floor reveals a higher stage of practice and accomplishment, demonstrating progress through the BHūmis (Bodhisattva levels).",
      "assembly_present": "Each floor of the house has its own Bodhisattvas Assembly, corresponding to the level of realization of that floor, culminating with the vision of all Buddhas in the tenth floor.",
      "main_dialogue": "Sudhana, marveling at the house, asks Ratnacūḍa about the cause of her good fortune. Ratnacūḍa narrates the story of his incense offering to the Buddha Anantaraśmidharmadhātusamalaṃkṛtadharmarma and his subsequent triple dedication of merit, explaining that this unique act was the seed for all his current achievements.",
      "main_teaching": "The release of Bodhisattva called \"The Unpaid Display of the Field of Prayer.\" The central teaching is about the power of the dedication of merit. Ratnacūḍa explains that all his vast fortune and ability to teach Dharma have come from a single act of generosity in a past life - offering a grain of incense to a Buddha - which he then dedicated to three goals: see all Kalyāṇamitras, all Buddhas and all Bodhisattvas.",
      "miraculous_manifestations": "The ten -story house is the main manifestation. Each floor represents a level of practice:\n- Lower floors: Fundamental practices such as generosity of food and clothing.\n- Fifth floor: Bodhisattvas of the fifth BHūmi discussing the treaties.\n- Sixth floor: Bodhisattvas practicing the perfection of wisdom.\n- Seventh floor: Irreversible bodhisattvas.\n- Eighth floor: Bodhisattvas manifesting in every kingdom.\n- Ninth floor: Bodhisattvas in their last life.\n- Tenth floor: The complete view of all Tathāgatas, from their first aspirations to Paririnvāṇa.",
      "spiritual_progression": "Sudhana learns about the exponential power of the dedication of merit and as a small act, when dedicated to the lighting of all beings, can generate inconceivable results. He also gains a visual and hierarchical understanding of the stages of Bodhisattva's path through the architecture of the house.",
      "transition": "Ratnacūḍa humbly admits that he only knows this release portal and directs Sudhana to find the samantinera perfume salesman in the city of Samantamukha, in the land of Vetramūlaka.",
      "unique_elements": "The use of architecture as a metaphor for the internships of the spiritual path. The demonstration of the power of a single act of generosity and the dedication of merit. The narrative of a past life as the direct cause of the circumstances present.",
      "character": {
        "name": "SUDARśANA",
        "teaching": "The liberation of the bodhisattva called \"The Unpaid Display of the Field of Prayer.\" The central teaching is about the power of the dedication of merit. Ratnacūḍa explains that all his vast fortune and ability to teach Dharma have come from a single act of generosity in a past life - offering a grain of incense to a Buddha - which he then dedicated to three goals: see all Kalyāṇamitras, all Buddhas and all Bodhisattvas.",
        "description": "Sudhana finds Ratnacūḍa and is invited to her home, a magnificent ten -story structure, which acts as a three -dimensional mandala of the Bodhisattva Journey.",
        "occupation": "Householder",
        "meaning": "Jewelry",
        "local": "The city of Siṃhapota, in a busy market, and its ten -story home.",
        "summary": "Sudhana finds Ratnacūḍa in the city market. Ratnacūḍa takes him to his ten-storey house made of gold. In the first four floors he witnesses the activity of generosity of the bodhisattvas, and on the fifth floor and above he sees Bodhisattvas discussing the Dharma. In the tenth walk all the bodhisattvas are in their last life. Ratnacūḍa tells Sudhana how, in the past, he made an offering offering to a Buddha and the aroma covered the whole world for a week.",
        "chapter_file_name": "18 RATNACŪḌA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1or5nj0smIXHWd8Sb19v2k3DM58ssVIqH/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=18",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo18.glb"
      }
    },
    {
      "chapter_number": 19,
      "chapter_title": "Samantanestra",
      "name_translation": "Universal eyes",
      "location": "A perfume store in the city of Samantamukha, in the land of Vetamūlaka.",
      "context": "Sudhana finds Samantinera in her store, where he not only sells perfumes, but applies a deep knowledge of fragrances and medicine to cure all kinds of diseases (physical, mental and spiritual).",
      "assembly_present": "Patients and beings of all ten directions that come in search of healing. After being cured and materially satisfied, they become the assembly that receives the teachings of the Dharma, showing a direct transformation of suffering into disciples.",
      "main_dialogue": "Samantinera explains to Sudhana his holistic method: he first heals physical diseases, then satisfies material needs and finally teaches the Dharma in a personalized way. For example, for those with desire, he teaches about impurity; To the angry ones, he teaches about love. He also details how his knowledge of perfumes allows him to make offerings to all Buddhas, demonstrating the interconnection between the worldly and the sacred.",
      "main_teaching": "The Dharma Portal called \"the forms of perfume that satisfy all beings.\" Samantinera dominates the knowledge of all perfumes and their healing properties. He teaches that true compassion begins with the healing of physical suffering. After healing the sick, he offers them teachings of the Dharma perfectly adapted to purify their mental afflictions (desire, anger, ignorance). His knowledge also extends to sacred perfumes that, when used as an offering, can reach and honor all Buddhas in the universe.",
      "miraculous_manifestations": "The main manifestation is the power of their perfumes. From a single type of sacred incense, it can manifest clouds of offerings - such as palaces, pavilions, banners, and perfume lights - that fill the whole kingdom of Dharma, reaching all Buddhas. It also demonstrates the ability to cure any disease, whether caused by physical imbalances, poisons, or mental afflictions.",
      "spiritual_progression": "Sudhana learns that practical compassion and specialized knowledge (in this case perfumery and medicine) are powerful portals to Bodhisattva's conduct. He understands that taking care of the immediate needs of beings is the first step in guiding them on the spiritual path.",
      "transition": "Samantinera, with humility, says that his knowledge is limited to this portal of perfumes and healing, and does not compare to the wisdom of the great Bodhisattvas which are \"kings of medicine.\" He directs Sudhana to the city of Tāladhvaja to find his next guide, King Anala.",
      "unique_elements": "Integration of Medicine and Dharma: The chapter offers a unique example of how a secular profession (doctor/perfumer) can be a complete spiritual path.",
      "character": {
        "name": "Samantanestra",
        "teaching": "The Dharma portal called \"the forms of perfume that satisfy all beings.\" Samantinera masters the knowledge of all perfumes and their healing properties. He teaches that true compassion begins with the healing of physical suffering. After healing the sick, he offers them Dharma teachings perfectly adapted to purify their mental afflictions (desire, anger, ignorance). His knowledge also extends to sacred perfumes that, when used as offerings, can reach and honor all buddhas in the universe.",
        "description": "Sudhana finds Samantinera in her store, where he not only sells perfumes but applies a deep knowledge of fragrances and medicine to cure all kinds of diseases (physical, mental and spiritual).",
        "occupation": "Perfumer",
        "meaning": "Universal eyes",
        "local": "A perfume store in the city of Samantamukha, in the land of Vetamūlaka.",
        "summary": "Sudhana finds Samantinera in a perfume store in the middle of the city. Samantinera describes how it can cure all diseases, heal beings and put them on the path to enlightenment. He is also able to make perfume offerings to all buddha realms. However, his knowledge is limited to this portal called the forms of perfume that satisfy all beings and through which, in all ways, offerings are made and the buddhas are honored.",
        "chapter_file_name": "19 SAMANTANETRA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1wBrJ7brrwUuAOH4vJxK2eOVA271JM0YY/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=19",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo19.glb"
      }
    },
    {
      "chapter_number": 20,
      "chapter_title": "Anala",
      "name_translation": "Fire",
      "location": "The city of Tāladhvaja, specifically in the king's throne room and later in his palace.",
      "context": "Sudhana finds King Anala presiding over a terrible punishment scenario. He witnesses demonic-looking executors mutilating and killing criminals, which fills him with revulsion. He doubts that such a king, engaged in acts that seem to violate the principles of a bodhisattva, may be a true kalyāṇamitra.",
      "assembly_present": "The initial assembly is made up of ten thousand ministers and illusory executors and criminals. An assembly of devas also intervenes from heaven to guide Sudhana.",
      "main_dialogue": "The chapter unfolds in a dramatic sequence: 1. Sudhana witnesses the king's violence and doubt.\n2. Devas appear in heaven, scolding Sudhana for doubting and reminding him that the wisdom and the skills of a Bodhisattva are inconceivable.\n3. Sudhana, sorry, approaches the king and asks for the teaching.\n4. King Anala takes him to his palace and reveals that everything was an illusion, explaining that he would never hurt any being and that he uses these manifestations to guide his people away from evil and establish them on the way to omniscience.",
      "main_teaching": "The release of the bodhisattva called the \"Attainment of Illusions). The central teaching is that compassion can manifest itself in paradoxical forms. Anala reveals that all executions and sufferings are mere illusions, created by him as a skillful way to shock and dissuade his subjects to commit the ten non-virtuous acts. He teaches that a bodhisattva can use understanding of the illusory nature of phenomena to guide unconventional beings.",
      "miraculous_manifestations": "The main manifestation is the creation of hyperrealist illusions: executors, criminals, and acts of violence. The contrast between the horrible scene of the punishments and the magnificence of the king's palace - where he takes Sudhana later - serves to accentuate the illusory nature of the experience.",
      "spiritual_progression": "Sudhana learns a fundamental lesson about not judging by appearances and about the complex nature of the skillful means (Upāya). He understands that the compassion of a Bodhisattva can transcend the conventional notions of good and evil. His faith in Kalyāṇamitras is tested and strengthened.",
      "transition": "King Anala humbly admits that he only knows this liberation through illusions and directs Sudhana to the city of Suprabha to find his next guide, King Mahāprabha.",
      "unique_elements": "Paradoxical skills: the shocking use of illusory violence to teach nonviolence.",
      "character": {
        "name": "Anala",
        "teaching": "The liberation of the bodhisattva called the \"Attainment of Illusions). The central teaching is that compassion can manifest itself in paradoxical forms. Anala reveals that all executions and sufferings are mere illusions, created by him as a skillful way to shock and dissuade his subjects to commit the ten non-virtuous acts. He teaches that a bodhisattva can use understanding of the illusory nature of phenomena to guide unconventional beings.",
        "description": "Sudhana finds King Anala presiding over a terrible punishment scenario.",
        "occupation": "King",
        "meaning": "Fire",
        "local": "The city of Tāladhvaja, specifically in the king's throne room and later in his palace.",
        "summary": "Sudhana meets King Anala sitting on the throne judging hundreds of thousands of criminals while a horde of terrifying executioners punishes them in many ways, creating a blood lake and a mountain of parts of bodies. Sudhana has doubts about whether King Anala is a Bodhisattva, but deities appear in heaven and tell him not to doubt. King Anala takes Sudhana to his palace and explains that what he saw is an illusion that the king creates to inspire beings to avoid bad deeds.",
        "chapter_file_name": "20 ANALA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1w1XCClLHCdSGgQ3_yYCQ1TWDsFcfi4J9/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=20",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo20.glb"
      }
    },
    {
      "chapter_number": 21,
      "chapter_title": "Mahāprabha",
      "name_translation": "Great light",
      "location": "The city of Suprabha, described as an inconceivable magnificence utopia, with seven jewelry pitty, seven diamond walls, and millions of heavenly palaces and pavilions.",
      "context": "Sudhana enters the most spectacular city of her journey and finds King Mahāprabha, who rules not by strength, but through the transforming power of universal love.It represents the enlightened leadership that creates a harmonious society.",
      "assembly_present": "The entire population of the city of Suprabha, which is made up of Bodhisattvas who practice Mahāyāna.The whole city acts as a living assembly, with unlimited offerings available freely on all the streets to anyone who needs it, including quintalions of maidens ready to be donated.",
      "main_dialogue": "Mahāprabha explains to Sudhana that he rules through love, not punishment.He demonstrates his power entering Samādhi, which causes a universal transformation of peace and happiness.He teaches that by taking care of the needs of beings and establishing a base of love, he guides them naturally to the path of enlightenment.",
      "main_teaching": "The conduct of the bodhisattva called the \"standard of great love\" and the corresponding Samādhi, \"exercise power over the world through the motivation of great love.\"Mahāprabha teaches that unconditional love is the most powerful force to govern and transform society.His method is first to satisfy all the material needs of his subjects and then guide them to the Dharma, eliminating the causes of conflict and suffering.",
      "miraculous_manifestations": "When the king enters his Samādhi, the whole city trembles in six directions, and a wave of pure happiness runs through all beings.The king's compassion is so powerful that he pacifies even wildlife and demonic beings (Rākṣas and Yakṣas) who abandon their violent nature.Heavenly offerings rain from heaven, and all the inhabitants of the kingdom, from humans to trees and rivers, bow to reverence.",
      "spiritual_progression": "Sudhana witnesses the supreme power of love as a force of social and spiritual transformation.He learns that true leadership is not based on control, but compassion, and that an environment of generosity and harmony is the most fertile terrain for spiritual awakening.",
      "transition": "Mahāprabha, like others, admits that his knowledge is limited to this portal of great love.He directs Sudhana to the city of Nthirā to find his next guide, the upgraduate, moving the focus of male leadership to female wisdom.",
      "unique_elements": "'- Love-based society: The chapter offers a detailed and practical view of how an entire society can be governed and transformed solely through love and compassion.- Nature's Answer: The King's Samādhi manifestation affects not only sentient beings, but also nature itself, with rivers, mountains and trees responding to their compassion.- Unlimited generosity: Free and free offerings available to everyone in the city demonstrate an economy based on abundance and detachment.",
      "character": {
        "name": "Mahāprabha",
        "teaching": "The conduct of the bodhisattva called the \"standard of great love\" and the corresponding samādhi, \"exercising power over the world through the motivation of great love.\" Mahāprabha teaches that unconditional love is the most powerful force to govern and transform society. His method is first to satisfy all the material needs of his subjects and then guide them to the Dharma, eliminating the causes of conflict and suffering.",
        "description": "Sudhana enters the most spectacular city of her journey and finds King Mahāprabha, who rules not by strength, but through the transforming power of universal love.",
        "occupation": "King",
        "meaning": "Great light",
        "local": "The city of Suprabha, described as an inconceivable magnificence utopia, with seven jewelry pitty, seven diamond walls, and millions of heavenly palaces and pavilions.",
        "summary": "After a long search, Sudhana finds the city of Suprabha, which seems to be miraculously made of precious materials. He finds King Mahāprabha sitting on a throne in the city, along with large amounts of goods, animals and women arranged as gifts. King Mahāprabha tells Sudhana that he has reached the conduct of Bodhisattva called the standard of the great love of countless buddhas and provides everyone in his kingdom all they wish.",
        "chapter_file_name": "21 MAHĀPRABHA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1WxwwnQ2gdb8KcnJ35IJYXNXeXiyc4OVC/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=21",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo21.glb"
      }
    },
    {
      "chapter_number": 22,
      "chapter_title": "Calm",
      "name_translation": "Still, firm",
      "location": "The city of Sthirā.",
      "context": "Sudhana finds Acalā at her parents' house. Her presence is so pure that the house itself emanates a golden light that grants samādhis to Sudhana through simple contact. Her beauty and the fragrance of her body surpass those of all beings in the realms of desire, except for the buddhas and advanced bodhisattvas, and no being can look at her with desire.",
      "assembly_present": "Although it is in a domestic environment, its assembly is composed of beings that are attracted and purified by its simple presence. The scene emphasizes that realization can flourish in any context, not just in isolated monasteries.",
      "main_dialogue": "In response to Sudhana's question, Acalā tells the story of her original aspiration and details how, by countless Kalpas, she maintained an immaculate practice, never forgetting a single teaching, never failing to practice a single Bodhisattva conduct and never diverting to lower vehicles. It demonstrates the power of its realization through a meditative vision.",
      "main_teaching": "Acalā teaches the liberation called \"the essence of wisdom difficult to achieve\" and the \"tireless pursuit of the Dharma.\" Her central teaching is about the strength of an unwavering initial aspiration. She tells how, in a past life countless kalpas ago, the vision of Buddha Pralambabāhu inspired her to develop such a powerful motivation that since then she has never had a thought of desire, anger, or ego, not even in dreams or in the state between lives.",
      "miraculous_manifestations": "The main manifestation is its own purity, which transforms the environment and the beings around it. Upon entering samādhi, she reveals the countless Sudhana Buddic kingdoms and the succession of Buddhas, demonstrating the power of her purified mind. Its realization is not ostensive, but a demonstration of internal perfection that naturally radiates.",
      "spiritual_progression": "Sudhana learns about the power of continuity and purity in spiritual practice. Acalā is the embodiment of unshakable dedication throughout ages, showing that a single aspiration, when maintained with perfect purity, leads to an inconceivable achievement. He understands that true strength is not in external deeds, but in internal purity maintained over time.",
      "transition": "Acalā humbly states that he only knows this release of wisdom difficult to reach and directs Sudhana to the land of Amitosala to find his next guide, Parivrājaka (wandering ascetic) Sarvagamin, moving the focus of wisdom cultivated in stability for that practiced in motion.",
      "unique_elements": "Transcendental purity in a common context: Acalā demonstrates the highest level of spiritual purity living in a family home, challenging the notion that realization requires imprisonment.",
      "character": {
        "name": "Calm",
        "teaching": "Acalā teaches the liberation called \"the essence of wisdom difficult to achieve\" and the \"tireless pursuit of the Dharma.\" Her central teaching is about the strength of an unwavering initial aspiration. She tells how, in a past life countless kalpas ago, the vision of Buddha Pralambabāhu inspired her to develop such a powerful motivation that since then she has never had a thought of desire, anger, or ego, not even in dreams or in the state between lives.",
        "description": "Sudhana finds calm at her parents' house.",
        "occupation": "Lay woman",
        "meaning": "Still, firm",
        "local": "The city of Stthirā.",
        "summary": "Sudhana arrives in the city of Sthirā and finds the upāsikā caliā at home with her parents, in a house that shines with a golden light that makes Sudhana enter states of samādhi. She is extremely beautiful, shining with light, and has an exceptional aroma. Acalā describes your past life like a princess during the time of Buddha Pralambabāhu. One night she saw him shining in the sky and has since followed his instructions for many Kalpas.",
        "chapter_file_name": "22 ACALĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1O95SwV5Drgwv6MiH4KFvES4ySxTMJoar/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=22",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo22.glb"
      }
    },
    {
      "chapter_number": 23,
      "chapter_title": "Sarvagamin",
      "name_translation": "The one who goes everywhere",
      "location": "The top of the Sulabha hill, near the town of Tosala, in the land of amitosala.",
      "context": "At dusk, Sudhana finds Sarvagamin at the top of a bright hill, being revered by ten thousand Brahmins that circulate it.It represents the realization that is not fixed in a place, but manifests itself everywhere to benefit beings.",
      "assembly_present": "Although physically accompanied by ten thousand Brahumnes, his true assembly is universal and invisible, composed of all beings in all kingdoms that he is simultaneously benefiting through his emanations.",
      "main_dialogue": "Sarvagamin explains to Sudhana that he benefits all beings through various methods.He can teach worldly crafts to some, the four means of gathering disciples to others, and perfections for those more advanced.He teaches in a way that seems personal and direct to each individual, without them knowing where he came from.",
      "main_teaching": "The conduct of the \"omnipresent\" bodhisattva and the \"light of all portals\" Samādhi.Sarvagamin teaches that his practice is to go everywhere, manifesting himself in perfectly adapted ways to guide all kinds of beings, from those who aspire to Mahāyāna to the followers of the 96 different heretical visions, leading each to their own level of ripening.",
      "miraculous_manifestations": "The main manifestation is its omnipresence.While physically at the top of the hill, it simultaneously appears in all villages, cities, markets and crossroads of Jambudvīpa (and, by extension, all kingdoms), teaching Dharma in a way that each being believes being receiving a personal and exclusive teaching.His physical body shines with a light that surpasses that of Mahābrahmā.",
      "spiritual_progression": "Sudhana learns that the conduct of a bodhisattva can transcend time and space limitations.He understands that true compassion is omnipresent, adapting perfectly to the needs of each being individually, everywhere at the same time.",
      "transition": "Sarvagamin, with humility, states that his knowledge, though ubiquitous, is just a portal.He directs Sudhana to the land of Pṛthurāṣṭra to find his next guide, the perfume seller UTPalabhūti, moving the focus of omnipresence to expert knowledge.",
      "unique_elements": "'- omnipresence as practice: The chapter explores the idea of a spiritual practice that is not confined to a place but manifests itself simultaneously everywhere.",
      "character": {
        "name": "Sarvagamin",
        "teaching": "The conduct of the \"omnipresent\" bodhisattva and the samādhi of the \"light of all portals.\" Sarvagamin teaches that his practice is to go everywhere, manifesting himself in perfectly adapted ways to guide all kinds of beings, from those who aspire to Mahāyāna to the followers of the 96 different heretical views, leading each to their own level of ripening.",
        "description": "At dusk, Sudhana finds Sarvagamin at the top of a bright hill, being revered by ten thousand Brahmins that circulate it.",
        "occupation": "Mendicant",
        "meaning": "The one who goes everywhere",
        "local": "The top of the Sulabha hill, near the town of Tosala, in the land of amitosala.",
        "summary": "After a long trip, Sudhana arrives in the town of Tosala on Earth called Amitosala. Having sought through the city, he goes to a bright hill called Sulabha north of the city. In his summit, he finds Sarvagamin being honored by ten thousand Brahumnes. Sarvagamin describes how, through the samādhi called the light of the practice of all portals, he can benefit beings in many ways in many worlds.",
        "chapter_file_name": "23 SARVAGAMIN Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1V84Td7uVeuhqhUKwSNKL8CHMZ2eyUza0/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=23",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo23.glb"
      }
    },
    {
      "chapter_number": 24,
      "chapter_title": "UTPalabhūti",
      "name_translation": "Blue Lotus Manifestation",
      "location": "The land of Pṛthurāṣṭra.",
      "context": "Sudhana finds Utpalabhūti, an expert who knows in depth all kinds of fragrances and their transforming effects. It represents the specialized knowledge applied with mastery for the spiritual benefit of beings.",
      "assembly_present": "The assembly is composed of all beings of the land of Pṛthurāṣṭra that benefit from the perfumes of Utpalabhūti, experiencing healing, happiness, and spiritual transformation through the power of fragrances.",
      "main_dialogue": "Utpalabhūti Cataloga for Sudhana a wide range of perfumes and their uses. He explains how he uses his knowledge to heal, pacify, and finally guide beings to Dharma, demonstrating how a worldly ability, when dominated, becomes a skillful means to awakening.",
      "main_teaching": "Knowledge of all perfumes and their properties. Utpalabhūti teaches how fragrances can be used to cure disease, dispel negative mental states, and induce spiritual experiences. He knows specific perfumes for each purpose, from generating worldly happiness to inspiring the memory of Buddhas and renunciation of desire.",
      "miraculous_manifestations": "Utpalabhūti describes the miraculous effects of specific perfumes. For example, the perfume \"Elephant Essence\" which, with a single particle, can scent an entire kingdom and make it rain golden flowers. Another, the \"Gośīrṣa\" sandalwood, makes the body immune to fire. The \"invincible\" perfume can defeat armies only with the sound of a fragrant drum with it. He also knows fragrances that can manifest heavenly armies or induce Samādhi states.",
      "spiritual_progression": "Sudhana learns that technical knowledge and specialization in a worldly area, when combined with compassion, can be a powerful path to lighting. He sees how sensory stimuli can be used to purify the mind and prepare it for deeper teachings.",
      "transition": "Utpalabhūti, recognizing the limits of his specialized knowledge, directs Sudhana to the city of Kūṭāgāra to find his next guide, the Vaira sailor. The journey moves from terrestrial and subtle knowledge of perfumes to navigation in the vast and dangerous oceans.",
      "unique_elements": "Encyclopedic knowledge: UTPalabhūti has an extraordinarily detailed and technical knowledge about a wide range of perfumes and their applications, showing the depth that can be achieved in any field.",
      "character": {
        "name": "UTPalabhūti",
        "teaching": "Knowledge of all perfumes and their properties. Utpalabhūti teaches how fragrances can be used to cure diseases, dispel negative mental states, and induce spiritual experiences. He knows specific perfumes for each purpose, from generating worldly happiness to inspiring the memory of buddhas and renunciation of desire.",
        "description": "Sudhana finds Utpalabhūti, an expert who knows in depth all kinds of fragrances and their transforming effects.",
        "occupation": "Perfumer",
        "meaning": "Blue Lotus Manifestation",
        "local": "The land of Pṛthurāṣṭra.",
        "summary": "Sudhana chega à terra chamada Pṛthurāṣṭra e encontra o comerciante de perfumes Utpalabhūti, que conta a Sudhana sobre seu domínio de perfumes que têm efeitos mágicos e espirituais.",
        "chapter_file_name": "24 UTPALABHŪTI Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1LJpoqMIkKoDkjofsglBNd7cfPlXw_txH/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=24",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo24.glb"
      }
    },
    {
      "chapter_number": 25,
      "chapter_title": "Bum",
      "name_translation": "Diamond",
      "location": "The coastal city of Kūṭāgāra.",
      "context": "Sudhana finds a boo on the coast, surrounded by a crowd of one hundred thousand traders.He is not just teaching about navigation, but using the ocean metaphors to reveal the depths of Dharma.",
      "assembly_present": "A wide multitude of one hundred thousand traders and hundreds of thousands of other people who gather on the coast to hear their stories and seek their guidance, both for physical and spiritual travel.",
      "main_dialogue": "Vaira explains to Sudhana her profound knowledge of navigation, from the reading of the stars to the forecast of winds and the knowledge of all the treasures and dangers of the ocean.He then uses each of these elements as an analogy for spiritual journey: treasures are the qualities of the Buddhas;the whirlpools, the wrong views;and the waves, the afflictions.He guides the beings for material wealth only to be able to guide them to spiritual wealth.",
      "main_teaching": "Bodhisattva's conduct called the \"standard of great compassion\" and the release of \"remembering to remain with hearing and fruitful vision.\"Vaira teaches that, just as he guides traders safely for material treasures islands, he also guides all beings through the dangerous ocean of Saṃsāra to the \"jewelry island\" of omniscience.His knowledge covers both the physical dangers of the sea (whirlpools, monsters) and the spiritual dangers (attachment, ignorance).",
      "miraculous_manifestations": "The main manifestation is its infallible ability as a browser.No ship under your command has ever had an accident.His mastery is such that the simple hearing of his teachings protects beings from the fear of \"sinking\" in the ocean of Saṃsāra and directs them to wisdom.",
      "spiritual_progression": "Sudhana learns that any profession, even a dangerous like that of sailor, can be a vehicle for the practice of universal compassion.He understands that a true guide (Kalyāṇamitra) is like an experienced captain, essential for safely navigating the dangers of the rebirth cycle and achieving lighting.",
      "transition": "Humility, he says that his knowledge is limited to navigation in the oceans of the world and the Dharma.He directs Sudhana to the city of Nandihāra to find his next guide, chief merchant Jayottama, moving the journey from the sea to the heart of civic and commercial life.",
      "unique_elements": "'- Navigation Metaphor: The chapter brilliantly uses navigation as a complete metaphor for the spiritual journey, with its dangers, treasures, and the need for an experienced guide.",
      "character": {
        "name": "Bum",
        "teaching": "The bodhisattva conduct called the \"standard of great compassion\" and the liberation of \"remembering to remain with hearing and fruitful vision.\" Vaira teaches that, just as he guides traders safely to islands of material treasures, he also guides all beings through the dangerous ocean of saṃsāra to the \"jewel island\" of omniscience. His knowledge covers both the physical dangers of the sea (whirlpools, monsters) and the spiritual dangers (attachment, ignorance).",
        "description": "Sailor",
        "occupation": "Sailor",
        "meaning": "Diamond",
        "local": "The coastal city of Kūṭāgāra.",
        "summary": "Sudhana goes to the city of Kūṭāgāra and finds the cloak of the city gate on the ocean coast, where he is telling the sea stories to a hundred thousand traders and many hundreds of thousands of others, describing the qualities of the Buddha. He tells Sudhana that he practices the bodhisattva conduct called the Flag of Great Compassion, helps beings in many ways, knows the location of islands and treasures and ways of navigating the ocean, and leads beings to enlightenment through his teachings.",
        "chapter_file_name": "25 VAIRA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1DMLHMUO6qOq1EiIoMS4WtuIryK4bGODq/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=25",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo25.glb"
      }
    },
    {
      "chapter_number": 26,
      "chapter_title": "Jayottama",
      "name_translation": "Supreme victory",
      "location": "An Ashoka tree forest called Vicitra Dhvaja on the outskirts of Nandihāra.",
      "context": "Sudhana finds Jayottama in the middle of a Civic Assembly, surrounded by thousands of heads of household. They are discussing civic duties, and Jayottama uses this opportunity to teach Dharma. It represents the figure of the enlightened social leader, which integrates civic responsibility with spiritual practice.",
      "assembly_present": "The assembly is multifaceted. Physically, he has thousands of heads of family. However, his true assembly is universal, composed of all beings in the countless kingdoms where he manifests himself, including devas, nāgas, humans, and even beings in infernal kingdoms, each receiving a teaching adapted to his condition.",
      "main_dialogue": "After Sudhana introduces himself formally and expressing his vast aspirations, Jayottama explains his ubiquitous conduct. He details as Dharma teaches in multiple kingdoms of existence to eradicate suffering and guide beings away from non-virtuous actions. He teaches about the creation and destruction of the worlds, the defects of the Saṃsāra and the qualities of omniscience.",
      "main_teaching": "The portal for the \"omnipresent\" bodhisattva conduct. Jayottama is based on \"non-compound miracles based on the absence of existence,\" which allows him to be present and teach simultaneously in all kingdoms of existence. Its main teaching is the elimination of all forms of ego, possessiveness and attachment as the path to peace and social harmony.",
      "miraculous_manifestations": "The main manifestation is its omnipresence. While physically in the forest, he teaches simultaneously in heavenly parades, the worlds of the nāgas, yakṣas, asuras, and in all villages and cities of the human world. He pacifies conflicts, prevents wars, and guides all kinds of beings, from the debris to the black, perfectly adapting their teachings to each one.",
      "spiritual_progression": "Sudhana learns that civic responsibility and social leadership are not separated from spiritual practice, but they can be a powerful expression of it. He witnesses how a bodhisattva can use his wisdom to create harmony and guide an entire society, operating on a universal scale for everyone's benefit.",
      "transition": "Jayottama, with humility, admits that his knowledge is limited to this portal of omnipresent conduct. He directs Sudhana to the city of Kaliṅgavana, in the land of śroṇāparānta, to find his next guide: Bhikṣuṇī (nun) SIṃha VijṛMBhitā, moving the focus of male secular leadership to female monastic life.",
      "unique_elements": "Civic Responsibility as a spiritual path: The chapter emphasizes the importance of social engagement and clarified leadership as a form of Bodhisattva practice.",
      "character": {
        "name": "Jayottama",
        "teaching": "The portal for the \"omnipresent\" bodhisattva conduct.Jayottama is based on \"non-compound miracles based on the absence of existence,\" which allows him to be present and teach simultaneously in all kingdoms of existence.Its main teaching is the elimination of all forms of ego, possessiveness and attachment as the path to peace and social harmony.",
        "description": "Sudhana finds Jayottama in the middle of a Civic Assembly, surrounded by thousands of heads of household.",
        "occupation": "City elder",
        "meaning": "Supreme victory",
        "local": "An Ashoka tree forest called Vicitra Dhvaja on the outskirts of Nandihāra.",
        "summary": "Sudhana arrives in the city called Nandihāra and finds Jayottama in a forest on the east side of the city, talking about civic duties to many thousands of heads of family.He tells Sudhana as in many worlds he teaches Dharma, peaceful disputes and wars, guides people away from bad behavior and puts them on the way to enlightenment.",
        "chapter_file_name": "26 JAYOTTAMA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1-8QOFBQLr1tFsPYDt89-TdLfoJFMh9v-/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=26",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo26.glb"
      }
    },
    {
      "chapter_number": 27,
      "chapter_title": "SIṃHA VIJṛMBHITā",
      "name_translation": "Lion",
      "location": "The Sūrya Pabha Park in the city of Kaliṅgavana, in the land of śroṇāparānta.The park is a miraculous manifestation of the hint of the nun, described with a magnificence that surpasses heavenly parades, with jewelry trees, fragrant lakes and thrones specifically prepared for each type of being.",
      "context": "Sudhana finds her vijṛmbhitā teaching the dharma to a immense and perfectly stratified assembly.It represents the pedagogical mastery and the realization that completely transcends pride.",
      "assembly_present": "The assembly is the most diverse and stratified so far, organized by hierarchical levels.Includes derses of the higher heavens to the kingdoms of desire, all kinds of nonhuman beings (nāgas, yakṣas, etc.), and practitioners of all three vehicles (śrāvaka, pratyekabubddha, mahāyāna), including bodhisattvas in each of the ten BHūmis, each group receiving a specific teaching.",
      "main_dialogue": "After marveling at the scene, Sudhana asks for instruction.Siṃha VijṛMBhitā reveals the name of his release and explains that his scope is the ability to interact with all beings and all Buddhas without generating the slightest trace of pride.It demonstrates that the highest achievement is humble and devoid of self-importance.",
      "main_teaching": "Bodhisattva release called the \"eradication of all pride\".From this achievement, she reached Samādhi from \"Agreement with all Dharmas\".Its central teaching is that true wisdom is non-conceptual and ego-free.Despite her miraculous skills and vast knowledge, she does not cling to the concept of \"beings\" she teaches, the \"Dharmas\" she hears, or the \"Buddhas\" she sees, remaining without arrogance.",
      "miraculous_manifestations": "The most prominent manifestation is its ability to teach simultaneously in innumerable distinct groups, each receiving a teaching perfectly adapted to its spiritual level.The park itself is a miracle.When Sudhana circulates her, she fills the whole park with light and he realizes it as always in front of him.In addition, she describes how, through her Samādhi, she travels mentally to make offerings to all Buddhas and Bodhisattvas in her last lives through the ten directions.",
      "spiritual_progression": "Sudhana learns a crucial lesson about the nature of true spiritual mastery: she is not only powerful, but also perfectly humble and devoid of ego.He witnesses pedagogical perfection, where a single master can guide countless beings simultaneously, adapting the message to each one.",
      "transition": "Siṃha vijṛmbhitā humbly admits that he knows this release only.She then directs Sudhana to the city of Ratnavyūha in the land of Durga to find her next guide: courtesan Vasumitraā.This shocking transition, from pure nun to courtesan, serves to radically break Sudhana's preconceived notions on where wisdom can be found.",
      "unique_elements": "Stratified Teaching: The clearest example of simultaneous teaching and adapted to multiple spiritual levels.",
      "character": {
        "name": "SIṃHAVIJṛMBHITā",
        "teaching": "Bodhisattva release called the \"eradication of all pride\". From this achievement, she reached Samādhi from \"Agreement with all Dharmas\". Its central teaching is that true wisdom is non-conceptual and ego-free. Despite her miraculous skills and vast knowledge, she does not cling to the concept of \"beings\" she teaches, the \"Dharmas\" she hears, or the \"Buddhas\" she sees, remaining without arrogance.",
        "description": "Monja - Sit on all thrones",
        "occupation": "Nun",
        "meaning": "Lion",
        "local": "The Sūrya Pabha Park in the city of Kaliṅgavana, in the land of śroṇāparānta. The park is a miraculous manifestation of the hint of the nun, described with a magnificence that surpasses heavenly parades, with jewelry trees, fragrant lakes and thrones specifically prepared for each type of being.",
        "summary": "Sudhana arrives in the city of Kaliṅgavana in the land of śroṇāparnt and finds ifivijṛmbhitā in a park called Sūryaprabha which, due to its miraculous power, is covered with jewelry and other miraculous manifestations. There are thrones at the foot of jewelry trees, in all of which sites siṃhavijṛmbhitā teaching the dharma to various types of beings and bodhisattvas. She tells Sudhana that she has reached Bodhisattvic release called the eradication of all presumption, which allows her to go in various forms to various worlds to make offerings to Buddhas and Bodhisattvas.",
        "chapter_file_name": "27 SIṂHAVIJṚMBHITĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1UJiZtShyygi4EOBxdpflx8c_heOLKpYx/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=27",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo27.glb"
      }
    },
    {
      "chapter_number": 28,
      "chapter_title": "Vasumitrā",
      "name_translation": "Wealth friend",
      "location": "The city of Ratnavyūha, in the land of Durga.",
      "context": "Sudhana looks for vasumitrā and finds a division in public opinion.Those who do not know their true nature judge him, questioning why a pure young man would seek a courtesan.Those who know their qualities congratulate him, knowing that he is on the right track for lighting.He finds it in a house of indescribable magnificence, with a beauty that overcomes that of all beings of the kingdom of desire.",
      "assembly_present": "The assembly is composed of all beings - devas, nāgas, humans and others - that come to it by desire.After interaction, they are transformed and established on the way of non-compliance, becoming an assembly of practitioners.",
      "main_dialogue": "After Sudhana's question, Vasumitrā explains his release.She tells that the seed for this ability was planted in a past life, when she was the wife of a merchant and, along with him, made a simple offering to a Buddha of the past, Atyuccagāmin.At that time, Mañjuśrī, the same initial guide as Sudhana, inspired her to develop aspiration for enlightenment.",
      "main_teaching": "The release of Bodhisattva called the \"complete realization of freedom of desire\".Vasumitrā teaches through direct transformation.Using her beauty and forms of physical contact as skillful means (Upāya), she guides all who approach her, dominated by desire, to a state of complete detachment.",
      "miraculous_manifestations": "Its main manifestation is the ability to transform desire into lighting through contact.Depending on the level of interaction, beings reach different Samādhis:",
      "spiritual_progression": "Sudhana learns one of the most radical lessons of her journey: that compassion and wisdom can manifest in the most unexpected and controversial forms.He understands that true purity is not in avoidance, but in the ability to transform even the most powerful of poisons (desire) into nectar.",
      "transition": "Vasumitrā, with humility, states that his knowledge is limited to this portal of the transformation of desire.She directs Sudhana to the city of śubhapāraṃgama to find her next guide, the head of household Veṣṭhila, who makes offer to a tathāgata sanctuary.The journey moves from the transformation of desire to practice devotion.",
      "unique_elements": "Paradoxical use of the profession: the use of a highly controversial profession, that of courtesan, as the highest means of teaching detachment.",
      "character": {
        "name": "Vasumitrā",
        "teaching": "The liberation of the bodhisattva called the \"complete realization of freedom of desire\". Vasumitrā teaches through direct transformation. Using her beauty and forms of physical contact as skillful means (Upāya), she guides all who approach her, dominated by desire, to a state of complete detachment.",
        "description": "Sudhana looks for vasumitrā and finds a division in public opinion.",
        "occupation": "Courtesan",
        "meaning": "Wealth friend",
        "local": "ŚUBHAPARAṃGAMA\n(city)",
        "summary": "Sudhana arrives in the city of Ratnavyūha in the land of Durga and seeks the courtesan Vasumitrā. People who do not know their qualities wonder why a practitioner like Sudhana would want to see her while those who know her qualities tell her where her home is. It is vast, composed of many buildings made of precious materials and divine aspect. She is beautiful and skilled in tongues and in all arts and treaties. Your body illuminates your residence. She tells Sudhana that she takes a beautiful form among various types of beings who are under the power of desire and teaches them Dharma to free them from desire, and that they also break free from desire to see her, touch her, kiss her, and so on.",
        "chapter_file_name": "28 VASUMITRĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1p6LzH4_G1caU5ylXM-puG_gj6LGkXb8U/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=28",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo28.glb"
      }
    },
    {
      "chapter_number": 29,
      "chapter_title": "Veṣṭhila",
      "name_translation": "The surroundings",
      "location": "The city of śubhapāraṃgama.",
      "context": "Sudhana finds Veṣṭhila, a devotee who makes offerings to a sanctuary that contains a tathman tonolus throne. It represents the realization that arises from the devotion and understanding of the continuous and incessant nature of the Buddhas.",
      "assembly_present": "The assembly is visionary, composed by the infinite lineage of all Buddhas of the past, present and future, which appear in the mind of Veṣṭhila through his Samādhi.",
      "main_dialogue": "Veṣṭhila explains to Sudhana that her realization arose when she opened the gate of the sanctuary. He details his vision of the uninterrupted succession of all three -stroke Buddhas and through all kingdoms, stating that it perfectly retains all its teachings. He emphasizes that this succession of Buddhas is incessant and known only through faith and diligence.",
      "main_teaching": "Bodhisattva release called \"the scope of the summit of inexhaustibility.\" The fundamental teaching is that Tathāgatas, in fact, never enter the final parinirvāṇa; they just manifest this as a skillful means to inspire beings. Through this understanding, Veṣṭhila reached the samādhi called \"the display of the incessant family of the buddhas.\"",
      "miraculous_manifestations": "The main manifestation is Veṣṭhila's vision. Upon entering Samādhi, he perceives, at a single mental moment, the uninterrupted succession of all Buddhas of the past, present and future. This view exponents exponentially, from one hundred Buddhas to a number equal to atoms in countless Búdic kingdoms. He not only sees the Buddhas, but all his journey: his first aspirations, the purification of his kingdoms, the realization of the perfections, and the turn of the Dharma wheel.",
      "spiritual_progression": "Sudhana learns about the continuity of the Buddic presence. He understands that Parirvāṇa is a skillful means and that the enlightened activity is incessant. The lesson about the \"Buddha Family\" reinforces the idea of a continuous lineage of wisdom and compassion that transcends time.",
      "transition": "He humbly admits that he only knows this release. He then gives Sudhana one of the most famous directions of the journey: to go south, to Mount Potalaka, the residence of the Bodhisattva Avalokiteśvara. He describes the beauty of Avalokite's abode in poetic verses, preparing Sudhana to meet the great bodhisattva of compassion.",
      "unique_elements": "The Nature of Nirvāṇa: The chapter offers a profound teaching about how nirvāṇa is not annihilation but a didactic manifestation.",
      "character": {
        "name": "Veṣṭhila",
        "teaching": "Bodhisattva release called \"the scope of the summit of inaccuracies.\" The fundamental teaching is that Tathāgatas, in fact, never enter the final Parinirvāṇa; They just manifest this as a skillful way to inspire beings. Through this understanding, Veṣṭhila reached Samādhi called \"the display of the incessant family of the Buddhas.\"",
        "description": "Sudhana finds Veṣṭhila, a devotee who makes offerings to a sanctuary that contains a tathman tonolus throne.",
        "occupation": "Householder",
        "meaning": "The surroundings",
        "local": "The city of śubhapāraṃgama.",
        "summary": "Sudhana vai para a cidade de Śubhapāraṃgama, onde encontra o chefe de família Veṣṭhila, que atingiu o samādhi chamado exibição incessante da família dos budas quando abriu a porta de um santuário. Através desse samādhi ele vê incontáveis budas do passado, presente e futuro.",
        "chapter_file_name": "29 VEṢṬHILA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1yNuhfoYgXviW2CNZiSg88dXwgW-mzpil/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=29",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo29.glb"
      }
    },
    {
      "chapter_number": 30,
      "chapter_title": "AVALOKITEśVARA",
      "name_translation": "Lord who hears the cries of the world",
      "location": "Mount Potalaka, described as a terrestrial paradise, with green pastures, crystal clear springs and forests, where Avalokiteśvara teaches on a slope.",
      "context": "Following the direction of Veṣṭhila, Sudhana finally arrives at the address of Avalokiteśvara. The sight of the bodhisattva fills him with deep faith, and he reflects that finding a kalyāṇamitra is the same as finding all the buddhas. Avalokiteśvara greets him, recognizing his qualities and his aspiration.",
      "assembly_present": "A vast assembly of countless bodhisattvas who are sitting on jewelry rocks, listening to the teaching about love and compassion. At the end of the chapter, another great Bodhisattva, Ananyagāmin, arrives from the east miraculously, making the whole world tremble and turn into jewelry.",
      "main_dialogue": "The dialogue is centered on active compassion. After greeting, Avalokiteśvara explains his release and details the numerous ways he protects beings from fear. He teaches that his ultimate goal is to establish all beings irreversibly on the way to complete lighting.",
      "main_teaching": "The \"portal without impediments of great compassion\". This is the central teaching of Avalokiteśvara, which consists of an incessant practice to protect and free all beings from all kinds of fear and suffering, without exception. His compassion is not passive, but an active force that manifests itself in countless ways to guide beings.",
      "miraculous_manifestations": "AvalokiteśVara manifests your power in many ways. It appears in forms adapted to the needs of each being, uses the four means of gathering disciples (generosity, kind words, benefit and consistency) and, most importantly, offers protection against all types of fear. He recites a long prayer and verses detailing how the mere remembrance of his name can save the beings from physical dangers (prison, execution, wild animals, fire, water), social (legal disputes, bad reputation) and spiritual (lower rebirths, separation of loved ones).",
      "spiritual_progression": "Sudhana receives the teaching on compassion in its most active and protective form. He learns that the bodhisattva compassion is not just a feeling, but a powerful force that can intervene directly in the world to relieve suffering. The arrival of Ananyagāmin further expands his vision on the abilities of the great Bodhisattvas.",
      "transition": "After his teaching, AvalokiteśVara directs Sudhana to his next guide, the newcomer Bodhisattva Ananyagāmin so that he can continue his investigation into Bodhisattva's conduct.",
      "unique_elements": "Protective Prayer: The chapter contains the famous prayer and verses of Avalokiteśvara, which have become a central practice in many Buddhist traditions to invoke protection against fear and danger.",
      "character": {
        "name": "AVALOKITEśVARA",
        "teaching": "The \"portal without impediments of great compassion\".This is the central teaching of Avalokiteśvara, which consists of an incessant practice to protect and free all beings from all kinds of fear and suffering, without exception.His compassion is not passive, but an active force that manifests itself in countless ways to guide beings.",
        "description": "Following the direction of Veṣṭhila, Sudhana finally arrives at the address of Avalokiteśvara.",
        "occupation": "Bodhisattva",
        "meaning": "Lord who hears the cries of the world",
        "local": "Mount Potalaka, described as a terrestrial paradise, with green pastures, crystal clear springs and forests, where Avalokiteśvara teaches on a slope.",
        "summary": "Sudhana goes to the Potalaka mountain and, on her western side, finds avalokiteśvara teaching inside a woods.AvalokiteśVara puts his radiant hand on Sudhana's head and tells him that he has the Bodhisattvica release called the unimpeded gate for great compassion.He describes how he benefits beings through various manifestations and emanations, freeing them from various types of fear.",
        "chapter_file_name": "30 AVALOKITEŚVARA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1POHHJ3eoLEmo6Sxwf98KnqZ6pgbQfSwu/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=30",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo30.glb"
      }
    },
    {
      "chapter_number": 31,
      "chapter_title": "Ananyagāmin",
      "name_translation": "The one who goes without obstacles",
      "location": "At the peak of a mountain of the Sahā world system, having arrived from the east.",
      "context": "Reluctantly, but obedient to instruction, Sudhana leaves avalokiteśvara and approaches the bodhisattva ananyagāmin, which had arrived miraculously.",
      "assembly_present": "Although the meeting is individual, the implicit assembly is the whole of all Buddhas and beings that Ananyagāmin has found and benefited in its cosmic and multidirectional journey.",
      "main_dialogue": "Sudhana asks Ananyagāmin about the origin of her release.Ananyagāmin first warns that his journey is incomprehensible to those without the proper merit roots, but, with Sudhana's insistence, he describes her in detail.He reveals the vastness of his practice, which completely transcends the common notions of time, space and individuality, as he performs these inconceivable tasks simultaneously in all directions.",
      "main_teaching": "The release of the bodhisattva called \"the emergence of the whole portal\".This teaching reveals the ability of a Bodhisattva to cross distances and periods of inconceivable time, while simultaneously benefits all beings and makes offerings to all the Buddhas in every kingdom he finds along the way.",
      "miraculous_manifestations": "The main manifestation is Ananyagāmin's own journey.He describes that he came from a Buddic kingdom in the east called śrīgarbhavatī, ruled by Tathāgata Samantaśrīsaṃbhava.The journey lasted a number of kalpas equal to atoms in an inexpressible number of built -in kingdoms.With each step he crossed an equally inconceivable number of kingdoms, making mental offerings every Buddha and at the same time realizing the minds of all beings and teaching them the Dharma adapted.This miraculous journey was performed simultaneously from all ten directions.",
      "spiritual_progression": "Sudhana's mind is expanded to an even larger cosmic scale.He learns that the conduct of an advanced Bodhisattva is not limited to a single location or a single timeline.Practice can be omnipresent and timeless, benefiting all beings everywhere, simultaneously.",
      "transition": "Ananyagāmin, following the pattern, humbly admits to knowing only this portal.He directs Sudhana to the south to the city of Dvāravatī, to find his next guide, the Divinity Mahādeva.",
      "unique_elements": "'- Inconcenterement Journey: The chapter offers the most detailed and mathematically inconceivable description of a spiritual journey, using the concept of \"inexpressible numbers\" (anabhilāpyānabhilāpya) to break the limitations of the conceptual mind.",
      "character": {
        "name": "Ananyagāmin",
        "teaching": "The release of the bodhisattva called \"the emergence of the whole portal\".This teaching reveals the ability of a Bodhisattva to cross distances and periods of inconceivable time, while simultaneously benefits all beings and makes offerings to all the Buddhas in every kingdom he finds along the way.",
        "description": "Reluctantly, but obedient to instruction, Sudhana leaves avalokiteśvara and approaches the bodhisattva ananyagāmin, which had arrived miraculously.",
        "occupation": "Universal traveler",
        "meaning": "The one who goes without obstacles",
        "local": "At the peak of a mountain of the Sahā world system, having arrived from the east.",
        "summary": "Sudhana will see the bodhisattva ananyagāmin, which says that in the eastern kingdom of śrīgarbhavatī he has reached the Bodhisattvic release called the emergence of each portal at the feet of the Buddha Samantaśrīsaṃbhava, and that he took countless kalpas to reach this world, although he went through countless kingdoms with each step.He also made offerings to all the Buddhas in those kingdoms and expressed bodies to benefit the beings there, and did it as he approached this world of all other directions simultaneously.",
        "chapter_file_name": "31 ANANYAGĀMIN Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1KO6YxcDSW-KInbacyEU_N4x7CMvy5WJp/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=31",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo31.glb"
      }
    },
    {
      "chapter_number": 32,
      "chapter_title": "Mahādeva",
      "name_translation": "Great dev",
      "location": "A temple in the crossroads of the city of Dvāravatī.",
      "context": "Sudhana finds Mahādeva, a deity that teaches Dharma in a busy crossroads, demonstrating her ability to interact with the world in a direct and powerful way.",
      "assembly_present": "The assembly is composed of all the inhabitants of the city of Dvāravatī and the innumerable beings he benefits through their manifestations, which are inspired by generosity and corrected in their behavior through their skillful means.",
      "main_dialogue": "Mahādeva first praises the rarity and importance of Bodhisattvas. He then demonstrates his release, the \"cloud network\", manifesting the treasures and explaining their adaptive teaching methods, which aim to divert the beings of the non-virtuous and establish them in the perfections.",
      "main_teaching": "Bodhisattva release called the \"Net of Clouds). This teaching operates in two main ways:",
      "miraculous_manifestations": "Arms that reach the oceans: Mahādeva extends its four arms to bring water from the four large oceans and wash your mouth, a gesture of cosmic power.",
      "spiritual_progression": "Sudhana learns about the dual application of a Bodhisattva wisdom: On the one hand, unlimited generosity to create merit, and on the other, the use of skillful, shocking and severe means to subdue afflictions and inspire correct practice. He learns that compassion can manifest in ways that transcend the conventional notions of kindness.",
      "transition": "Mahādeva, humbly, states that he knows only this release of the \"cloud network\" and cannot understand the conduct of the bodhisattvas that are like Indra fighting the kleshas. He directs Sudhana to the land of Magadha in Bodhimaṇḍa to find his next guide: the goddess of the earth called Stthāvarā.",
      "unique_elements": "Divinity at the Crossroads: The kalyāṇamitra is a deity operating in the heart of a city, showing the presence of the sacred in the mundane.",
      "character": {
        "name": "Mahādeva",
        "teaching": "Bodhisattva release called the \"Net of Clouds). This teaching operates in two main ways:",
        "description": "Shiva",
        "occupation": "Deva (Divinity)",
        "meaning": "Great dev",
        "local": "A temple in the crossroads of the city of Dvāravatī.",
        "summary": "Sudhana arrives in the city called Dvāravatī and finds the deity Mahādeva in a temple in the city center. When Sudhana asks him for instructions, he extends the four arms to the four large oceans and brings back water to rinse his mouth. He praises the Bodhisattvas, who are so difficult to find, and states that he has reached the Bodhisattvic release called Cloud Network. Through this liberation, he manifests mountains of jewelry and precious objects before Sudhana to use them as offerings to the Buddhas in order to obtain merit.",
        "chapter_file_name": "32 MAHĀDEVA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/163vdVBOLBjVU1vG0KEgkt6k860BKy-Az/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=32",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo32.glb"
      }
    },
    {
      "chapter_number": 33,
      "chapter_title": "Stthāvarā",
      "name_translation": "Stable",
      "location": "The bodhimaṇḍa (place of lighting) in the land of Magadha.",
      "context": "Upon arriving at Bodhimaṇḍa, Sudhana is greeted by Nthāvarā and a million other earth goddesses who, upon her arrival, make the world tremble, rain flowers and perfumes, and reveal treasures of the earth. Sthāvarā presents herself as a witness to the roots of merit that Sudhana himself planted in that place in past lives.",
      "assembly_present": "A million goddesses of the earth who act in unison with Sthāvarā to receive Sudhana.",
      "main_dialogue": "Stthāvarā asks Sudhana if he wants to see proof of his past merits. After Sudhana's agreement, she reveals the treasures. She then explains her own liberation, the \"essence of invincible wisdom,\" which she has practiced since the era of the Buddha Dīpaṅkara, which allows her to follow and protect all the bodhisattvas and witness the incessant activity of all Buddhas.",
      "main_teaching": "The release of Bodhisattva called the \"essence of invincible wisdom\". The central teaching is that the practices and merits of a Bodhisattva are not lost, but are preserved and witnessed by the land itself. Sthāvarā demonstrates that Sudhana's journey is sustained by his own past actions, revealing to him the tangible fruits of his merit.",
      "miraculous_manifestations": "The main manifestation is the revelation of Sudhana's treasures. By striking the ground with her foot, Sthāvarā causes millions of precious treasures to appear from the earth, explaining that they are the maturation of Sudhana's merit and are there for him to use. Other miracles include the earth's trembling, the illumination of the world, the flowering of all trees, and the sound of countless musical instruments.",
      "spiritual_progression": "Sudhana learns a fundamental lesson about karmic causality: he concretely sees that his past actions have generated tangible results that now support his spiritual journey. He understands that the path of Bodhisattva is continuous through lives and that the world itself serves as guardian and witness to merit.",
      "transition": "Stthāvarā humbly states that he knows this release only and cannot understand the conduct of the most advanced Bodhisattvas. She directs Sudhana to the city of Kapilavastu to find her next guide, the goddess of Vāsantī night.",
      "unique_elements": "Own merit as a treasure: the manifestation of treasures is not a gift, but the revelation of the merit accumulated by the practitioner himself.",
      "character": {
        "name": "Stthāvarā",
        "teaching": "The liberation of the bodhisattva called the \"essence of invincible wisdom.\" The central teaching is that the practices and merits of a bodhisattva are not lost but are preserved and witnessed by the earth itself. Sthāvarā demonstrates that Sudhana's journey is sustained by his own past actions, revealing to him the tangible fruits of his merit.",
        "description": "Upon arriving at Bodhimaṇḍa, Sudhana is greeted by Nthāvarā and a million other earth goddesses who, upon her arrival, make the world tremble, rain flowers and perfumes, and reveal treasures of the earth.",
        "occupation": "Goddess of the earth",
        "meaning": "Stable",
        "local": "The bodhimaṇḍa (place of lighting) in the land of Magadha.",
        "summary": "Sudhana deixa o sul da Índia e chega ao bodhimaṇḍa em Magadha. Quando ele se aproxima da deusa da terra, Sthāvarā, outro milhão de deusas da terra declaram que um grande ser realizado está se aproximando. Elas manifestam uma série de aparências miraculosas. Sthāvarā afirma que Sudhana acumulou méritos neste lugar em vidas passadas e demonstra o seu resultado pisando o chão, de modo que aparecem milhões de tesouros que Sudhana sempre poderá usar.",
        "chapter_file_name": "33 STHĀVARĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1FDwkCCv-_kSXq9cbc-yf8ywD23fAlysA/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=33",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo33.glb"
      }
    },
    {
      "chapter_number": 34,
      "chapter_title": "Vāsantī",
      "name_translation": "Spring Goddess",
      "location": "In the sky, above the city of Kapilavastu.",
      "context": "Upon arriving in Kapilavastu at dusk, Sudhana sees Vāsantī in a Kūṭāgāra (pavilion) of jewelry in heaven.Your body is the color of the gold and contains the stars, the moon and the planets.Within her pores, Sudhana sees a manifestation of all her compassionate activity, including all the beings she has already saved and the methods she uses to guide them.",
      "assembly_present": "The assembly is visionary, perceived within the pores of Vāsantī.It is composed of all the countless beings she protected and guided in all kingdoms and situations, from those she saved from inferior rebirths to those she has established on the path of omniscience.",
      "main_dialogue": "Vāsantī explains its release and exhaustively details the ways as it protects beings in all kinds of dangerous and dark situations.She then narrates the story of her original aspiration, which emerged in the presence of the Buddha Sarvadharmanigarjitaja in a past life, and how she obtained this release in the presence of the Buddha Sumerudhvajāyatanaśāntatraśrī.",
      "main_teaching": "The release of the bodhisattva called \"the portal to guide beings through the radiance of the Dharma that eliminates the darkness of all beings.\"Vāsantī's teaching is protective compassion in action.It is dedicated to being a refuge for all who suffer, especially in darkness and danger, using various methods to protect them from physical damage and guide them away from spiritual suffering and erroneous visions.",
      "miraculous_manifestations": "The main manifestation is the vision that Sudhana has within the pores of Vāsantī, where he sees all the beings she helped, her teaching methods and her own journey of Bodhisattva.In addition, it details as manifesting adapted forms (such as the sun, the moon, a ship captain, a horse king, or the spotlight) to actively protect the beings from specific dangers, such as wrecks, to lose in deserts, to fall from cliffs or be attacked by bandits.",
      "spiritual_progression": "Sudhana learns about compassion as an active, protective and tireless force that operates in times of greatest vulnerability of beings (night, darkness, danger).He understands that the work of a Bodhisattva is to be a universal refuge, dissipating not only the darkness of ignorance, but also the literal darkness that brings fear and suffering.",
      "transition": "Vāsantī humbly admits that he only knows this portal of liberation.She directs Sudhana to find the next goddess of the night in Bodhimaṇḍa, called Samantagambhīraśrīvimalaprabhā.",
      "unique_elements": "'- Protector of Darkness: The unique role of Vāsantī as a goddess of the night whose practice focuses on protecting beings during physical and spiritual darkness.",
      "character": {
        "name": "Vāsantī",
        "teaching": "The liberation of the bodhisattva called \"the portal to guide beings through the radiance of the Dharma that eliminates the darkness of all beings.\" Vāsantī's teaching is protective compassion in action. It is dedicated to being a refuge for all who suffer, especially in darkness and danger, using various methods to protect them from physical damage and guide them away from spiritual suffering and erroneous visions.",
        "description": "Upon arriving in Kapilavastu at dusk, Sudhana sees Vāsantī in a Kūṭāgāra (pavilion) of jewelry in heaven.",
        "occupation": "Night goddess",
        "meaning": "Spring Goddess",
        "local": "In the sky, above the city of Kapilavastu.",
        "summary": "Sudhana arrives in Kapilavastu and, after sunset, sees the goddess of Vāsantī night in the sky over the city. She has a golden body, and he sees in her pores the kingdoms of beings she released and her various emanations, and he also hears from his pores the teachings of Dharma she gave. She tells Sudhana that she reached Bodhisattvica release, called the gate to guide beings through the radiance of the Dharma that eliminates the darkness of all beings. It describes how it helps various beings that are distressed in various ways in darkness, and how it free the beings from the darkness of Saṃsāra and protects and saves the beings from physical and spiritual dangers.",
        "chapter_file_name": "34 VĀSANTĪ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1-8n6Tse6Ue3YEV0PDcdilxeBhydaRw3D/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=34",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo34.glb"
      }
    },
    {
      "chapter_number": 35,
      "chapter_title": "Samanta Gambleīra śrī Vimala Prabhā",
      "name_translation": "Immaculate Universal Deep Glory",
      "location": "In Bodhimaṇḍa, in the land of Magadha, near Vāsantī.",
      "context": "Sudhana finds another goddess of the night that personifies the depth of meditation (śamatha) and the clear view of the nature of the Buddhas.",
      "assembly_present": "The assembly is its own internal view of all the tathāgatas of the past, present and future, which it perceives through its deep meditative absorption.",
      "main_dialogue": "In response to Sudhana's question, the goddess first lists the ten qualities that a Bodhisattva must possess.Then she explains her own release, detailing how she perceives the fundamental nature of tathāgatas as being beyond any dualistic concept.It also explains how the four dhyānas (meditative absorptions) applies with compassionate motivation to benefit all beings.",
      "main_teaching": "The release of the bodhisattva called \"complete subjugation through the blessing of peace of śamatha\".The goddess teaches Sudhana ten essential qualities for the practice of Bodhisattva, including the direct perception of Tathāgatas, the vision of their bodies, the understanding of their oceans of qualities, lights, emanations and teachings.Its own liberation allows you to realize that Buddhas are, in their true nature, non-nod, incessant and as an illusion-transcending the concepts of existence and non-existence.",
      "miraculous_manifestations": "The central manifestation is its meditative vision.Through her Samādhi, she perceives all the Buddhas of the three times, her kingdoms and assemblies.It also describes how it uses meditation to guide beings, for example, instilling the perception of ugliness in carnal pleasures to break attachment and inspiring those with virtuous thoughts, creating the conditions for them to reach omniscience.",
      "spiritual_progression": "Sudhana learns about the importance of fundamental qualities for practice and the power of meditation śamatha (mental calm) as the basis for wisdom.He understands that the true nature of Buddhas transcends concepts of coming and going, and that deep meditation is a powerful tool for compassionate activity in the world.",
      "transition": "The goddess humbly claims to know only this liberation and directs Sudhana to find the next goddess of the night, pramuditanayanajagadvirocanā, who is nearby.",
      "unique_elements": "'- The ten qualities of Bodhisattva: The chapter provides a clear and structured list of ten qualities that define the practice of a Bodhisattva.",
      "character": {
        "name": "Samantagambhīraśrīvimalaprabhā",
        "teaching": "The liberation of the bodhisattva called \"complete subjugation through the blessing of the peace of śamatha.\" The goddess teaches Sudhana ten essential qualities for the practice of the bodhisattva, including the direct perception of the tathāgatas, the vision of their bodies, the understanding of their oceans of qualities, lights, emanations, and teachings. Her own liberation allows her to realize that buddhas are, in their true nature, non-born, incessant, and like an illusion—transcending the concepts of existence and non-existence.",
        "description": "Sudhana finds another goddess of the night that personifies the depth of meditation (śamatha) and the clear view of the nature of the Buddhas.",
        "occupation": "Night goddess",
        "meaning": "Immaculate Universal Deep Glory",
        "local": "In Bodhimaṇḍa, in the land of Magadha, near Vāsantī.",
        "summary": "Sudhana returns to Bodhimaṇḍa and sees the goddess of the night Samantagambhīraśrīvimalaprabhā. She instructed him about the ten qualities that bodhisattvas need to achieve. She states that she has attained the bodhisattvic liberation called complete subjugation through the blessed peace of śamatha, through which she can see all buddhas of the three times, receive all their teachings, and mature beings in many ways.",
        "chapter_file_name": "35 SAMANTAGAMBHĪRAŚRĪVIMALAPRABHĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1-nzNFOAyOVpC2hIcFuHy-Hd320paSYyK/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=35",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo35.glb"
      }
    },
    {
      "chapter_number": 36,
      "chapter_title": "Pramudita Nayana Jagad Virocanā",
      "name_translation": "The one that illuminates the world with cheerful eyes",
      "location": "In Bodhimaṇḍa, within the great assembly of the Buddha.",
      "context": "Sudhana approaches the goddess, whose name means \"the one whose cheerful eyes illuminate the world.\"She is in a deep Samādhi called \"the banner of the power of the vast, immaculate and perfectly good joy.\"",
      "assembly_present": "The assembly is universal, composed of all clouds of emanations and all beings in the infinite kingdoms that are being taught and benefited by them.",
      "main_dialogue": "After Sudhana praises what she saw, he asks how long she reached this release.The goddess narrates a long story of her past lives, beginning with her first aspiration to illumination there are countless kalpas, in the presence of the Buddha śrīsamudra.It details the ages and the many Buddhas it found, showing the immense perseverance necessary until, finally, in the presence of the Buddha Ratnaśrīpradspaguṇaketu, it reached this release.She also reveals that Mañjuśrī was a king in one of her past lives.",
      "main_teaching": "The release of the bodhisattva that demonstrates the incessant and unlimited joy of the practice of the ten perfections (pāramitās) for the benefit of all beings.The teaching is not verbal, but a visionary demonstration.",
      "miraculous_manifestations": "Of every poro of the goddess's body, Sudhana witnesses the emanation of clouds of bodies, as numerous as all beings, who spread throughout all the kingdoms.Each cloud of emanations is dedicated to the practice and teaching of one of the ten perfections: generosity, discipline, patience, diligence, meditation, wisdom, skillful means, prayer, power and knowledge.These emanations assume the form of all kinds of beings (devas, nāgas, humans, etc.) to teach Dharma in a perfectly adapted way to each other.",
      "spiritual_progression": "Sudhana receives the most detailed view of the practice of ten perfections, not as abstract concepts, but as a cosmic activity, multifaceted and full of joy.He learns that the true practice of Bodhisattva is a spontaneous and inexhaustible expression that emanates from the realization for the good of all.",
      "transition": "The goddess humbly admits that she only knows this portal of the liberation of compassionate joy and directs Sudhana to the next goddess of the night, samantasattvatrāṇojajajajajrī.",
      "unique_elements": "'- The ten perfections in action: the most explicit and systematic demonstration of the ten perfections manifested as a universal and simultaneous activity.",
      "character": {
        "name": "Pramuditanayanajagadvirocanā",
        "teaching": "The liberation of the bodhisattva that demonstrates the incessant and unlimited joy of the practice of the ten perfections (pāramitās) for the benefit of all beings. The teaching is not verbal, but a visionary demonstration.",
        "description": "Sudhana approaches the goddess, whose name means \"the one whose cheerful eyes illuminate the world.\"",
        "occupation": "Night goddess",
        "meaning": "The one that illuminates the world with cheerful eyes",
        "local": "In Bodhimaṇḍa, within the great assembly of the Buddha.",
        "summary": "Sudhana goes to the south side of Bodhimaṇḍa, where she sees the goddess of pramuditanayanajagadvirocanā. Sudhana sees bodies emanated, as numerous as all beings, leaving all her pores, teaching the path of Bodhisattva to beings in different languages and forms. Sudhana praises her in verse and then asks her when she reached her Bodhisattvica release, called the flag of the power of vast joy, without macula and completely good.",
        "chapter_file_name": "36 PRAMUDITANAYANAJAGADVIROCANĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1g7KSQafUfQnLgZA0ZmFXXnDkanWKfuQP/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=36",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo36.glb"
      }
    },
    {
      "chapter_number": 37,
      "chapter_title": "Samanta Sattva Trāṇojaḥ śrī",
      "name_translation": "Glory of the universal protection of beings",
      "location": "In the bodhimaṇḍa.",
      "context": "Continuing his journey through the Assembly of Goddesses of the Night, Sudhana finds SamantasTatvatrāṇojajajajar, whose name means \"glory of the power that protects all beings.\"",
      "assembly_present": "The assembly is made up of all beings in all kingdoms of suffering (hells, animal kingdoms, black worlds, etc.) who are the direct beneficiaries of their compassion and miraculous emanations.",
      "main_dialogue": "The goddess explains to Sudhana that her liberation is the manifestation of universal compassion.She describes how, over countless Kalpas, she cultivated compassion as her central practice, making offerings to all Buddhas and aspiring to protect all beings.She tells how her compassion leads her to enter all the kingdoms of suffering to rescue beings, acting like a mother to the unprotected.",
      "main_teaching": "The release of the bodhisattva called \"the manifestation of great compassion that protects all beings and establishes them in practice.\"This teaching focuses on compassion as the root of the whole practice of Bodhisattva.The goddess shows that true compassion is not a passive feeling, but the driving force that leads a bodhisattva to enter all kingdoms and interact with all kinds of beings to alleviate their suffering and guide them to enlightenment.",
      "miraculous_manifestations": "From his body emanate clouds of light that reach all beings in all kingdoms, extinguishing the sufferings of hells, the misery of black (hungry ghosts) and the brutality of animals.Light then assumes the form of Bodhisattvas that teach Dharma according to the needs of each being, guiding them out of suffering and towards happiness and finally to enlightenment.",
      "spiritual_progression": "Sudhana deepens her understanding of compassion as the indispensable foundation for Bodhisattva's conduct.He sees that all the practices and powers of a bodhisattva emanate from a compassionate commitment to relieve suffering, no matter where he is.",
      "transition": "The goddess, with humility, states that her knowledge is limited to this portal of protective compassion.She directs Sudhana to the next goddess of the night, for Praśāntarutasāgaravatī.",
      "unique_elements": "'- Compassion as a root: The chapter emphasizes compassion (Karuṇā) as the root of all other Bodhisattva practices.",
      "character": {
        "name": "Samantasatatvatrāṇojajajaḥśrī",
        "teaching": "The liberation of the bodhisattva called \"the manifestation of great compassion that protects all beings and establishes them in practice.\" This teaching focuses on compassion as the root of the entire bodhisattva practice. The goddess demonstrates that true compassion is not a passive feeling, but the driving force that leads a bodhisattva to enter all realms and interact with all kinds of beings to alleviate their suffering and guide them to enlightenment.",
        "description": "Continuing his journey through the assembly of Night Goddesses, Sudhana finds Samantasattvātrāṇojaḥśrī, whose name means \"Glory of the Power that Protects All Beings.\"",
        "occupation": "Night goddess",
        "meaning": "Glory of the universal protection of beings",
        "local": "In the bodhimaṇḍa.",
        "summary": "When Sudhana walks a distance to see the night goddess Samantasattvatrāṇojaḥśrī, she radiates a ray of light that makes him enter a samādhi and see worlds in the atoms of the soil, and see her appearing in all of them to guide and help beings through the power of her bodhisattvic liberation called the manifestations that guide the beings that appear in all worlds. Sudhana recites verses to her, describing this vision, and asks her when she attained this liberation.",
        "chapter_file_name": "37 SAMANTASATTVATRĀṆOJAḤŚRĪ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1HW4ukW5J3BIC5zupSFqxaN8MCSJEq9SI/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=37",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo37.glb"
      }
    },
    {
      "chapter_number": 38,
      "chapter_title": "Praśāntarutasāgaravatī",
      "name_translation": "The one that has the ocean of peaceful sounds",
      "location": "In the bodhimaṇḍa.",
      "context": "Sudhana finds the next goddess of the night, whose name means \"the one whose sound is peaceful as the ocean,\" and she teaches him about the joy that arises from the vision of Buddha activity.",
      "assembly_present": "The assembly is multifaceted, consisting of its own view of Buddhas and Bodhisattvas, and also in all beings it guides, from those that discourage worldly pleasures to those it establishes on the way to enlightenment.",
      "main_dialogue": "The goddess describes her liberation as a source of inexhaustible joy. She details the various visions that fill her with joy - such as seeing the Bodhisattvas assemblies, the body of the Vairocana Buddha and its infinite manifestations. She also explains how she uses this joy to teach Dharma, adapting it to transform attachment into detachment and ignorance into wisdom. She narrates her past journey, starting with her aspiration under the Buddha Avavartyadharmadhātunirghoṣa.",
      "main_teaching": "The release of Bodhisattva called \"The exhibition at every mental moment of the emergence of the power of vast joy.\" The central teaching is that the joy of a Bodhisattva arises from the contemplation of the vastness of Buddhas activity and its own ability to benefit beings. She explains that her practice is to eliminate suffering and unhappiness and then guide beings to the Dharma delight, culminating in the supreme happiness of omniscience.",
      "miraculous_manifestations": "The main manifestation is the visionary joy of the goddess. Seeing the body of the Vairocana Buddha, its emanations of light, the emanations of Buddha bodies of its pores, the emanations of countless practitioners of the path of Bodhisattva and the emanation of all kinds of beings (devas, nāgas, etc.), it experiences an ocean of joy in every moment. This joy is not passive, but inspires it to teach Dharma in a way that brings happiness to all.",
      "spiritual_progression": "Sudhana learns that joy is an essential component and a result of Bodhisattva's practice. He understands that contemplation of Buddha's qualities and activities is an inexhaustible source of inspiration and delight, which in turn becomes the energy to benefit others.",
      "transition": "The goddess humbly admits that she knows only this portal of joy and directs Sudhana to the next goddess of the night, Sarvanagarakṣāsambhavatejaḥśrī.",
      "unique_elements": "Contemplative joy: Practice is centered on the joy that arises from the vision of Buddha activity rather than an external action.",
      "character": {
        "name": "Praśantarutasāgaravatī",
        "teaching": "The liberation of the bodhisattva called \"the manifestation at each mental moment of the arising of the power of vast joy.\" The central teaching is that a bodhisattva's joy arises from the contemplation of the vastness of buddha activity and their own ability to benefit beings. She explains that her practice is to eliminate suffering and unhappiness and then guide beings to the delight of the Dharma, culminating in the supreme happiness of omniscience.",
        "description": "Sudhana finds the next goddess of the night, whose name means \"the one whose sound is peaceful as the ocean,\" and she teaches him about the joy that arises from the vision of Buddha activity.",
        "occupation": "Night goddess",
        "meaning": "The one that has the ocean of peaceful sounds",
        "local": "In the bodhimaṇḍa.",
        "summary": "Sudhana goes straight to the goddess of the night for the Tarutasāgaravatī, who says she has reached the bodhisattvic liberation called the manifestation at each moment of the mind of the arising of the power of the vast delight. She explains that she teaches Dharma everywhere in various ways to beings and can see all the bodhisattvas wherever they are and whatever they are doing. In particular, she sees the Buddha, whom she calls Vairocana, who at every moment radiates rays of light everywhere that assume various forms to guide beings, and seeing this gives her great pleasure.",
        "chapter_file_name": "38 PRAŚANTARUTASĀGARAVATĪ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/15tyjojZnCqiRGA5xid3poDrtBIoWpgwi/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=38",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo38.glb"
      }
    },
    {
      "chapter_number": 39,
      "chapter_title": "Sarva Nagara Rakṣā Saṃbhava Tejaḥ śrī",
      "name_translation": "The glory of the splendor born of the protection of all cities",
      "location": "Sudhana finds her sitting on a great lotus throne, with a sequin of countless goddesses of the night.",
      "context": "Sudhana approaches the goddess, whose body manifests simultaneously in all directions, appearing before all beings adapted to guide and mature them.",
      "assembly_present": "A grade of countless goddesses of the night.Her effective assembly, however, is all beings she guides.The story of his past life includes a sequino of one hundred thousand nuns.",
      "main_dialogue": "After Sudhana's question, the goddess explains her liberation.It details the ten ways of understanding the kingdom of phenomena and how it teaches through myriads of Dhāraṇīs.She then tells the long story of her past life, there are countless Kalpas to illustrate the depth of her practice and the time she took to achieve this release, revealing that she found and served a succession of Buddhas as numerous as the atoms on Mount Sumeru.",
      "main_teaching": "The release of Bodhisattva called \"the entry into beautiful sounds and deep manifestations.\"This release allows it to act like a `dharmabhāṇaka` (Dharma preacher) at an unable level.Its practice is based on ten deep understandings of the Kingdom of Phenomena (DharmaDhātu) and the domain of ten thousand portals of mental retention (DHāraṇīs) to teach Dharma, guide all beings and preserve the lineage of Tathāgatas.",
      "miraculous_manifestations": "The main manifestation is your own body, which appears simultaneously in all kingdoms to all beings.She narrates a story of a past life in which, like Bhikṣuṇī Dharma Cakra Nirmāṇa Prabhā, she witnessed a follower of the Dharma (a passed incarnation of Samantabhadra) climb to the skies and emanate clouds of light to relive the teaching of the Buddha, which was declining.Inspired, she and her 100,000 -nurse entourage became irreversible on the way to lighting.",
      "spiritual_progression": "Sudhana learns about the depth of a Bodhisattva commitment, which extends for countless ages.He understands that the perception of the kingdom of phenomena and the mastery of DHāraṇīs are fundamental to teaching.Upon hearing the teaching, he himself reaches an ocean of Samādhis and portals of retention, deepening his own practice.",
      "transition": "The goddess humbly claims to know only this portal of liberation.She directs Sudhana to find the next Kalyāṇamitra: The Sarva Night Goddess Vṛkṣpraphullana Sukhasaṃvāsā, which is at the feet of the Vairocana Bhagavat.",
      "unique_elements": "'- The ten understandings of the kingdom of Dharma: a structured teaching on how to perceive the ultimate reality.",
      "character": {
        "name": "Sarvanagarakrakṣāsaṃbhavatejaḥśrī",
        "teaching": "The liberation of the bodhisattva called \"entry into beautiful sounds and profound manifestations.\" This liberation allows her to act as a `dharmabhāṇaka` (Dharma preacher) at an unimpeded level. Her practice is based on ten profound understandings of the realm of phenomena (dharmadhātu) and the mastery of ten thousand portals of mental retention (dhāraṇīs) to teach the Dharma, guide all beings, and preserve the lineage of the tathāgatas.",
        "description": "Sudhana approaches the goddess, whose body manifests simultaneously in all directions, appearing before all beings in forms adapted to guide and mature them.",
        "occupation": "Night goddess",
        "meaning": "The glory of the splendor born of the protection of all cities",
        "local": "Sudhana finds her sitting on a great lotus throne, with a sequin of countless goddesses of the night.",
        "summary": "Sudhana vê a deusa da noite Sarvanagararakṣāsaṃbhavatejaḥśrī sentada em um trono de lótus e tendo um corpo que pode aparecer e se comunicar com todos os seres. Ela diz a ele que alcançou a liberação bodhisattvica chamada entrada em belos sons e manifestações profundas. Ela descreve como guia os seres, ensinando o Dharma de várias maneiras, e como vê o reino dos fenômenos de dez maneiras e ensina através de milhares de poderes de retenção mental, dez dos quais ela lista.",
        "chapter_file_name": "39 SARVANAGARARAKṢĀSAṂBHAVATEJAḤŚRĪ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1MpF-hIcWTaSFsUo-0yF8euMmwL3rf4Gt/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=39",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo39.glb"
      }
    },
    {
      "chapter_number": 40,
      "chapter_title": "Sarva Vṛkṣpraphullana Sukha Saṃvāsā",
      "name_translation": "The one that resides in the joy of the flowering of all trees",
      "location": "In a kūṭāgāra (pavilion) made of precious trees, sitting on a lion throne made of tree seedlings.",
      "context": "Sudhana finds the goddess who, at sunset, influences all beings to seek refuge and rest.His presence is a catalyst for correct practice, inspiring beings to abandon afflictions (greed, laziness, anger) and practice the perfections.",
      "assembly_present": "A grade of ten thousand goddesses of the night.The assembly of the narrative includes all the inhabitants of Jambudvīpa suffering under the five degenerations, and crucially the bodhisattvas of the current meeting of Vairocana, which are revealed as the same beings, now established in irreversible stages of the path.",
      "main_dialogue": "The goddess explains her liberation and, to illustrate her, tells the detailed story of the compassionate king and her own past life as Ratnaprabhā, the daughter of a merchant.Ratnaprabhā, inspired by the king's generosity, made an offering and a prayer to become like him.The dialogue reveals that the king was a past incarnation of Vairocana, his parents were incarnations of śuddchodana and Māyādevī, and the beings he saved are now the bodhisattvas in the present assembly.",
      "main_teaching": "The release of Bodhisattva called \"the emergence of the vast light radiant of joy.\"The fundamental teaching is that all the happiness that beings experience is a reflection of the merit and blessing of Tathāgatas.The joy of a Bodhisattva arises from understanding the compassionate conduct of Buddhas like Vairocana, which, in past lives, made votes to alleviate the suffering of all beings.",
      "miraculous_manifestations": "The chapter is dominated by a long narrative (Jātaka) of a life past from the Vairocan Buddha like King Sarva Dharma nirnādacchatra maṇḍala nirghoṣa.The king presided over a world that fell into the \"five degenerations,\" where the earth was sterile and beings suffered.In response to his laments, the king made a vow of compassion and performed an act of universal generosity, giving everything he had.The birth of the king himself was miraculous, causing the waters to return, the trees flourish, and treasures arose from the earth, transforming the world from a hell of suffering into an abundance paradise.",
      "spiritual_progression": "Sudhana learns a profound lesson on karmic causality and the interconnection of lives.He sees how compassion and generosity of a single Bodhisattva (the King/Vairocana) can transform a whole world and plant the seeds that mature in the assembly of advanced practitioners he now witnesses.He learns that joy is the natural result of understanding the vast and compassionate Buddha activity.",
      "transition": "The goddess humbly states that she knows only this portal of joy.She directs Sudhana to find the next goddess of the night, Sarva-Jagad Rakṣā for Praṇidhāna Vīrya Prabhā, who is also in Bodhimaṇḍa.",
      "unique_elements": "'- The five degenerations: a vivid description of an age of decline and its subsequent transformation through compassion.",
      "character": {
        "name": "SARVAVṛKṣPraphullanasukhasaṃvāsā",
        "teaching": "The liberation of the bodhisattva called \"the emergence of the vast light radiant of joy.\" The fundamental teaching is that all the happiness that beings experience is a reflection of the merit and blessing of Tathāgatas. The joy of a Bodhisattva arises from understanding the compassionate conduct of Buddhas like Vairocana, which, in past lives, made votes to alleviate the suffering of all beings.",
        "description": "Sudhana finds the goddess who, at sunset, influences all beings to seek refuge and rest.",
        "occupation": "Night goddess",
        "meaning": "The one that resides in the joy of the flowering of all trees",
        "local": "In a kūṭāgāra (pavilion) made of precious trees, sitting on a lion throne made of tree seedlings.",
        "summary": "The goddess of the night Sarvavṛkṣpraphullanasukhasaṃvāsā is sitting in a kūṭāgāra, a throne made of precious branches. She tells Sudhana how night makes the beings want to return to her homes and how she leads beings to good conduct and release. She states that she has reached Bodhisattvica release called the emergence of the vast radiant of joy, and that she has the knowledge to gather beings as students. Through it, it remembers the past conduct, the progress and the realization of the Buddha, referred to as Vairocana.",
        "chapter_file_name": "40 SARVAVṚKṢPRAPHULLANASUKHASAṂVĀSĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1M_rLGFCRJjHymBk4330lhPXnmBhDqPws/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=40",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo40.glb"
      }
    },
    {
      "chapter_number": 41,
      "chapter_title": "Sarva Jagad Rakṣā Praṇidhāna Vīrya Prabhā",
      "name_translation": "Light of vote of votes to protect the whole world",
      "location": "In Bodhimaṇḍa, in the middle of his entourage.",
      "context": "Sudhana finds the goddess, whose body manifests all of the cosmos (sun, moon, stars) and appears adapted to all beings. Its simple view gives Sudhana ten types of pure perceptions, deepening its connection with the path of Kalyāṇamitra.",
      "assembly_present": "The assembly is multifaceted: the goddess's entourage, and in the narrative, the kingdom suffering population, the ministers, the royal court, and finally the vast assembly that meets to witness the arrival of the Buddha.",
      "main_dialogue": "The dialogue occurs in two parts. First, the goddess describes her liberation and the countless qualities she manifests to guide beings. Then, to answer Sudhana's question about how long she reached this release, she tells the detailed story of Prince Vijitāvin, revealing in the end that she herself was the prince. She also reveals the past identities of other characters in history: the condemned ministers became the 500 men sent by Devadatta to assassinate the Buddha, and the criminals she saved became the Buddhas of \"Kalpa Fortuna\" (Bhadrakalpa) and other Bodhisattvas.",
      "main_teaching": "The release of the bodhisattva called \"the origin of the roots of merit that inspire the maturation of all beings.\" The central teaching is about the power of sacrificial compassion. The goddess narrates her own history of a past life, there are countless kalpas, like Prince Vijitāvin. Moved by overwhelming compassion, the prince offered to be executed in place of thousands of criminals that his father, the king, had imprisoned in order to free them.",
      "miraculous_manifestations": "The chapter is dominated by the narrative of the goddess's past life. The climax of history is the miracle arrival of that era Buddha, Dharma Cakra Nirghoṣa Gagana Megha Pradīpa Rāja, where the prince was about to be sacrificed. The presence of the Buddha transforms the assembly, and its teaching of the Dharma leads numerous beings to enlightenment and establishes Prince Vijitāvin irreversibly on the way.",
      "spiritual_progression": "Sudhana learns about compassion carried out to her extreme: the willingness to sacrifice their own lives for the good of others, even by those who committed terrible acts. He learns that such compassion is the true \"origin of the roots of merit\" and that the path of Bodhisattva transcends the conventional notions of time and identity, as shown by the revelations about the past lives of the characters.",
      "transition": "The Goddess, with humility, states that she knows only this portal of liberation. She directs Sudhana to find her next guide in the Lumbinī Forest: the Sutejoma Goddess Rati śrī.",
      "unique_elements": "Sacrificial compassion: The central theme is personal sacrifice as the supreme act of compassion.",
      "character": {
        "name": "Sarvajagadrakṣāpraṇidhānavīryaprabhā",
        "teaching": "The liberation of the bodhisattva called \"the origin of the roots of merit that inspire the maturation of all beings.\" The central teaching is about the power of sacrificial compassion. The goddess narrates her own history of a past life, there are countless kalpas, like Prince Vijitāvin. Moved by overwhelming compassion, the prince offered to be executed in place of thousands of criminals that his father, the king, had imprisoned in order to free them.",
        "description": "Sudhana finds the goddess, whose body manifests all of the cosmos (sun, moon, stars) and appears adapted to all beings.",
        "occupation": "Night goddess",
        "meaning": "Light of vote of votes to protect the whole world",
        "local": "In Bodhimaṇḍa, in the middle of his entourage.",
        "summary": "Sudhana sees Sarvajagadrakṣāpraṇidhānavīryaprabhā with the image of all the stars, and everything else, in her body. It manifests bodies in various ways for beings throughout the kingdom of phenomena. Looking at her, Sudhana reaches ten pure perceptions and numerous \"similarities\" with the bodhisattvas. Sudhana goes to her in verse, and she tells her that she has reached Bodhisattvic release called the origin of the roots of merit that inspire the maturity of all beings. This means that, having performed the unreality of phenomena, it can manifest itself in any way miraculous to benefit beings at every moment.",
        "chapter_file_name": "41 SARVAJAGADRAKṢĀPRAṆIDHĀNAVĪRYAPRABHĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1XpVIyv22-XsSSLvFK9qkzLtLd1ToBTZB/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=41",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo41.glb"
      }
    },
    {
      "chapter_number": 42,
      "chapter_title": "Sutejomaṇḍala Rati śrī",
      "name_translation": "Splendor of joy in the luminous male",
      "location": "In the Lumbinī Forest, the place of birth of the Buddha śākyamuni.",
      "context": "Sudhana arrives at the Holy Forest of Lumbinī and finds the goddess teaching Dharma to a vast assembly of two hundred thousand trillion goddesses of the forest. She is teaching a sūtra called \"the ocean of lives of all the bodhisattvas.\"",
      "assembly_present": "Two hundred thousand trillion goddesses of the forest. The narrative of his past life involves the assemblies gathered for the birth of a Buddha.",
      "main_dialogue": "The goddess first describes the ten births of Bodhisattva. Then, in response to Sudhana's question about her own journey, she narrates a past life, there are countless kalpas, in which she was Vimala saṃbhava Prabhā, the nurse of the Buddha śśvara guṇāparājita dhvaja. In holding the newborn Bodhisattva on her lap, she reached this same release and made the vote to witness the births of all future Buddhas. She also reveals that the mother of that Buddha was a past incarnation of Māyādevī and the father of śuddchodana.",
      "main_teaching": "The release of the bodhisattva called \"the miraculous manifestations in the birth of the bodhisattvas.\" The goddess teaches about the ** ten types of \"births\" ** or stages that a bodhisattva crosses to be born in the \"family of tathāgatas\". These births are not literal, but they represent milestones on the spiritual journey, such as dedication to the service of all Buddhas, the awakening of aspiration to enlightenment, the certainty in the Dharma, the purity of motivation and the realization of the Tathāgatas lineage.",
      "miraculous_manifestations": "The goddess demonstrates her liberation describing the ** ten omens and the ten manifestations of light ** that occurred in the Lumbinī forest before the birth of the Buddha. These miracles include the leveling of the earth, the ground becoming diamond, the trees blooming, and the arrival of countless divine beings. She also reveals that in each of her pores she can see the miraculous births of all Bodhisattvas in every kingdom and in all atoms.",
      "spiritual_progression": "Sudhana learns that the birth of a Bodhisattva is not a unique event, but a continuous process of spiritual development that culminates in birth in the \"Buddha Family.\" He understands the sacred and cosmic nature of the Buddha Birth Place (Lumbinī) and how past events are intrinsically linked to the present.",
      "transition": "The Goddess, with humility, states that she knows only this portal of liberation. She directs Sudhana to find her next guide in the city of Kapilavastu: The maiden śāky called Gopā, the wife of Prince Siddhārtha before her resignation.",
      "unique_elements": "Bodhisattva's ten births: a clear and didactic structure that defines the stages of maturation on the path of Bodhisattva.",
      "character": {
        "name": "Sutejomaṇḍalaratiśrī",
        "teaching": "The liberation of the bodhisattva called \"the miraculous manifestations in the birth of the bodhisattvas.\" The goddess teaches about the ** ten types of \"births\" ** or stages that a bodhisattva crosses to be born in the \"family of tathāgatas\". These births are not literal, but they represent milestones on the spiritual journey, such as dedication to the service of all Buddhas, the awakening of aspiration to enlightenment, the certainty in the Dharma, the purity of motivation and the realization of the Tathāgatas lineage.",
        "description": "Sudhana arrives at the Holy Forest of Lumbinī and finds the goddess teaching Dharma to a vast assembly of two hundred thousand trillion goddesses of the forest.",
        "occupation": "Night goddess",
        "meaning": "Splendor of joy in the luminous male",
        "local": "In the Lumbinī Forest, the place of birth of the Buddha śākyamuni.",
        "summary": "Sudhana goes to the Lumbinī Forest and sees Sutejomaṇḍalaratiśrī within a kūṭāgāra made of precious branches of trees, teaching a sūtra to millions of forest goddesses. She teaches Sudhana in prose and again in verse the ten types of birth through which a Bodhisattva enters the Tathāgatas family. She states that she has reached the Bodhisattvic liberation called the miraculous manifestations at the birth of Bodhisattvas through all the perceptions of countless Kalpas.",
        "chapter_file_name": "42 SUTEJOMAṆḌALARATIŚRĪ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1vRGLmDBHK67XsQfNyADzuHHqLazg48bG/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=42",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo42.glb"
      }
    },
    {
      "chapter_number": 43,
      "chapter_title": "Gopā",
      "name_translation": "Guardian",
      "location": "In the Bodhisattvas Assembly Hall called \"Dharma Kingdom Illuminating Light\" in the city of Kapilavastu.",
      "context": "Sudhana arrives at the Assembly Hall and is greeted by the goddess of the salon, Aśokaśrī, who praises him for his dedication. He then finds Gopā, sitting on a lotus throne, surrounded by eighty-four thousand women from real families who share their same aspirations and past practices.",
      "assembly_present": "Eighty-four thousand women from real families who are their companions on the way.",
      "main_dialogue": "Sudhana asks a series of profound questions about the paradoxical nature of Bodhisattva's conduct (as they can transcend the world and yet act on it). Gopā responds by explaining the ten qualities that allow a Bodhisattva to perform this conduct, such as trusting Kalyāṇamitras, having a vast aspiration and pure compassion. She then describes her own release, detailing the vastness of her vision, which covers the entire scope of cosmic history and the activity of all Buddhas and Bodhisattvas.",
      "main_teaching": "The release of the bodhisattva called \"the field of vision of all the paths of the ocean of Samādhis dos Bodhisattvas.\" Gopā teaches that bodhisattvas, although they act in Saṃsāra, are not stained by him. They understand the illusory nature of phenomena but do not abandon beings. Her liberation allows her to observe, in a single moment, all the kalpas, all the buddhas that have emerged, all their past actions, their assemblies, their teachings, and the journey of all their followers (śrāvakas, pratyekabuddhas, and bodhisattvas) with perfect detail.",
      "miraculous_manifestations": "The main manifestation is Gopā's own view. Through its Samādhi, it has access to a complete cosmic memory, realizing the totality of Buddha activity in the three times through countless kingdoms, including the full journey of the Vairocana Buddha since its early aspirations.",
      "spiritual_progression": "Sudhana learns about the non-compliance with Bodhisattva practice. He understands that for a bodhisattva, there is no contradiction between the wisdom that transcends the world and the compassion that acts on it. He learns that the highest achievement involves a panoramic and omniscient view of all Dharma activity through time and space.",
      "transition": "Gopā humbly admits that his knowledge is limited to this portal of liberation. She directs Sudhana to find her next guide, the Mother of the Buddha, Māyādevī, to learn about the vote of the great compassion of the Bodhisattvas.",
      "unique_elements": "The perspective of Buddha's wife: offers a rare glimpse of Gopā's perspective, portraying it not as an abandoned figure, but as a highly performed bodhisattva by its own right.",
      "character": {
        "name": "Gopā",
        "teaching": "The release of the bodhisattva called \"the field of sight of all the paths of the ocean of Samādhis dos Bodhisattvas.\"Gopā teaches that the bodhisattvas, although they act in Saṃsāra, are not stained by him.They understand the illusory nature of phenomena, but do not abandon beings.Its release allows you to observe, in a single moment, all the Kalpas, all the Buddhas that have emerged, all their past actions, their assemblies, their teachings, and the journey of all their followers (śrāvakas, PratyekaBuddhas and Bodhisattvas) with perfect details.",
        "description": "Sudhana arrives at the Assembly Hall and is greeted by the goddess of the salon, Aśokaśrī, who praises him for his dedication.",
        "occupation": "Girl",
        "meaning": "Guardian",
        "local": "In the Bodhisattvas Assembly Hall called \"Dharma Kingdom Illuminating Light\" in the city of Kapilavastu.",
        "summary": "Sudhana arrives in Kapilavastu and is greeted and praised by Aśokaśrī, the goddess of the Kapilavastu Assemblies Hall.Sudhana describes her path of Bodhisattva.She and other goddesses then make offerings and praise him in verse.Sudhana enters the Assembly Hall and sees Gopā and her delegation of real women, all practitioners of the path of Bodhisattva.In prose and then in verse, Gopā teaches Sudhana the ten qualities of Bodhisattva's conduct and the ten ways to please the kalyāṇamitras.She states that she has reached Bodhisattvica release called the range of all the ways of the Bodhisattvas Samādhis Ocean.",
        "chapter_file_name": "43 GOPĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1A7XNn3mds_EmMjDUti1TbtXtAWrMzJrp/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=43",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo43.glb"
      }
    },
    {
      "chapter_number": 44,
      "chapter_title": "Māyādevī",
      "name_translation": "Illusion, Mother of Buddha",
      "location": "In a miraculous (pavilion) kūṭāgāra that appears from the ground, in a large jewelry lotus.",
      "context": "Before finding Māyādevī, Sudhana is greeted by several goddesses who guide and prepare him, teaching him about the purification of the \"city of mind\" as a prerequisite to find a true kalyāṇamitra. Finally, he sees Māyādevī in a magnificent throne, his body transcending all worldly and divine forms.",
      "assembly_present": "Although the meeting seems individual, the Assembly is cosmic and visionary, including all beings and Buddhas of the past, present and future that are connected to its prayer and its function as a mother of the Buddhas.",
      "main_dialogue": "Māyādevī explains his liberation, revealing that his role as a mother of the Buddhas extends through all kingdoms and all times. She tells how, at the time of the conception of the Bodhisattva Siddhārtha, rays of light from all Buddhas entered her, allowing her to understand the totality of Buddha activity. She also tells the story of her own original aspiration, in a past life like the goddess of Bodhimaṇḍa Netraśrī, where she made the vow to always be the mother of a past incarnation of Vairocana.",
      "main_teaching": "The release of the bodhisattva called \"the display of the illusory conjures of the wisdom of the great prayer.\" The central teaching of Māyādevī is that she, through the power of her prayers and her realization, serves as the mother of all bodhisattvas in their final existence, not just the Buddha Śākyamuni. Her liberation is the ability to provide the perfect receptacle (the womb) for the birth of a being destined for enlightenment, an act that is itself a manifestation of wisdom that comprehends the illusory nature of birth and existence.",
      "miraculous_manifestations": "The body of Māyādevī is the main manifestation. His womb becomes vast as space, capable of containing inconceivable assemblies of Bodhisattvas, Devas and other beings who have witnessed Bodhisattva's residence in the womb. In his pores, Sudhana sees the past lives of the Buddha, her acts of generosity, and the myriads of kingdoms where he practiced. The birth of Bodhisattva is accompanied by ten omens and ten manifestations of light, and Māyādevī's own body radiates a light that overshades all other sparkles in the universe.",
      "spiritual_progression": "Sudhana learns that the birth of a Buddha is not a common biological event, but a cosmic and miraculous act, facilitated by the compassion and wisdom of a being like Māyādevī. It comprises the concept of \"universal motherhood,\" the ability to nourish and give light to lighting in all beings, and how it is rooted in prevailing precede and practices.",
      "transition": "Māyādevī, with humility, states that he knows only this portal of liberation. She directs Sudhana to Paraíso Trāyastriṃśa to find her next guide, the daughter of Deva Smṛtimat, called Surendrābhā.",
      "unique_elements": "Mother of All Buddhas: The chapter radically redefines Māyādevī, not as the mother of a single historical Buddha, but as a cosmic principle, the matrix that gives birth to all enlightened beings.",
      "character": {
        "name": "Māyādevī",
        "teaching": "The liberation of the bodhisattva called \"the display of the illusory conjures of the wisdom of the great prayer.\" The central teaching of Māyādevī is that it, through the power of its prayers and its fulfillment, serves as the mother of all the bodhisattvas in their final existence, not just the Buddha śākyamuni. Its release is the ability to provide the perfect receptacle (the uterus) for the birth of a being intended for enlightenment, an act that is itself a manifestation of wisdom that comprises the illusory nature of birth and existence.",
        "description": "Before finding Māyādevī, Sudhana is greeted by several goddesses who guide and prepare him, teaching him about the purification of the \"city of mind\" as a prerequisite to find a true kalyāṇamitra.",
        "occupation": "Buddha Mother",
        "meaning": "Illusion, Mother of Buddha",
        "local": "In a miraculous (pavilion) kūṭāgāra that appears from the ground, in a large jewelry lotus.",
        "summary": "Ratnanetrā, the goddess of the city, appears in heaven to Sudhana and instructs how to take care of the city of her mind. Then two goddesses of the body, dharmapadmaśrīkuśalā and hrśrīmañjariprabhāvā, appear to him, praising Māyādevī and shining over Sudhana a light that brings achievements. He then finds a Rākṣasa, guardian of the Bodhisattvas meeting hall, which teaches him two sets of ten qualities related to the Kalyāṇamitras. Sudhana sees before him a gigantic lotus, in the center of which there is a kūṭāgāra, within which is Māyādevī, which can appear anywhere in any being in various forms.",
        "chapter_file_name": "44 MĀYĀDEVĪ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/16lJFuA44mA8ZtGrN_EPxlzpkyqDtopEr/view?usp=drive_link,",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=44",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo44.glb"
      }
    },
    {
      "chapter_number": 45,
      "chapter_title": "Surendrābhā",
      "name_translation": "Splendor of the Lord of the Devas",
      "location": "Trāyastriṃśa's paradise (the heaven of the 33 gods).",
      "context": "Sudhana ascends to the heavenly kingdom and finds the goddess Surendrābhā. He reverences her and asks to be taught about Bodhisattva's conduct.",
      "assembly_present": "The meeting is individual, between Sudhana and Surendrābhā in the paradise of Trāyastriṃśa. There is no large assembly described; The focus is on the direct transmission of the teaching.",
      "main_dialogue": "Surendrābhā answers Sudhana's question by detailing the extension of his memory. It lists several kalpas and the vast number of Buddhas that served in each. She explains that, having heard and retained the teachings of all these Buddhas, it constantly remains within this release of pure memory.",
      "main_teaching": "The release of Bodhisattva called \"The Display of Pure and Unimpeded Memory\" (The Display of Pure, Unimpeded Memory). Surendrābhā is a transcendental memory power. She can perfectly remember an inconceivable number of past kalpas and all the Buddhas she served in these Eons. Your memory is not just a passive record; It retains and understands all the teachings it heard, remembering the whole life cycle of each Buddha, from the initial aspiration to the extinction of its Dharma.",
      "miraculous_manifestations": "Manifestation is the very vastness of its memory. It does not describe external miracles, but the scale of its internal practice: serving a number of Buddhas equal to the sand grains in dozens of ganges rivers, in multiple kalpas with poetic names (utpala, subhūti, suprabha). Miracle is your mind's ability to contain and access this unimaginable amount of experience and knowledge without any impediment or forgetfulness.",
      "spiritual_progression": "Sudhana learns about the importance of memory and retention (DHāraṇī) in the practice of Bodhisattva. The lesson is that the spiritual journey is not a series of disconnected events, but an uninterrupted continuum of learning and service. Surendrābhā demonstrates that the mind of a bodhisattva can become a living repository of all the Dharma taught through the ages.",
      "transition": "Surendrābhā, with the characteristic humility of the Kalyāṇamitras, states that he knows only this release of memory. She directs Sudhana back to the human world to the great city of Kapilavastu, to find her next guide: a children's teacher named VIśvāmitra. The transition from the heavenly kingdom to a worldly classroom prepares the scenario for another surprising contrast.",
      "unique_elements": "Memory as release: The power of memory is not just a college, but a complete release in itself, a portal for the Dharma.",
      "character": {
        "name": "Surendrābhā",
        "teaching": "The liberation of Bodhisattva called \"The Display of Pure and Unimpeded Memory\" (The Display of Pure, Unimpeded Memory). Surendrābhā is a transcendental memory power. She can perfectly remember an inconceivable number of past kalpas and all the Buddhas she served in these Eons. Your memory is not just a passive record; It retains and understands all the teachings it heard, remembering the whole life cycle of each Buddha, from the initial aspiration to the extinction of its Dharma.",
        "description": "Sudhana ascends to the heavenly kingdom and finds the goddess Surendrābhā.",
        "occupation": "Goddess of the thirty -three heavens",
        "meaning": "Splendor of the Lord of the Devas",
        "local": "Trāyastriṃśa's paradise (the heaven of the 33 gods).",
        "summary": "Sudhana arrives in the paradise of Trāyastriṃśa and Surendrābhā tells her that she has reached Bodhisattvic release called the display of pure and unimpeded memory. This allows her to remember to serve countless Buddhas along countless kalpas, from the first development of aspiration to lighting to the moment her dharma ceases.",
        "chapter_file_name": "45 SURENDRĀBHĀ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1aMn6JQMtEmStrLPt4J07lP-1Ut6G3sgN/view?usp=drive_link,",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=45",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo45.glb"
      }
    },
    {
      "chapter_number": 46,
      "chapter_title": "Viśvāmitra",
      "name_translation": "Universal friend",
      "location": "The city of Kapilavastu.",
      "context": "Sudhana, after descending from paradise Trāyastriṃśa, finds Viśvāmitra, who is described simply as a teacher of children, and asks for teachings.",
      "assembly_present": "The meeting is between Sudhana and Viśvāmitra.",
      "main_dialogue": "The dialogue is the shorter and shorter of the journey. Sudhana asks for instruction on the conduct of the bodhisattva, and I saw immediately redirects him to someone else, the young śilpābhijña, who has the specific knowledge that Sudhana seeks.",
      "main_teaching": "The teaching of this Kalyāṇamitra is humility and recognition of their own limits. Instead of offering a speech or describing a complex realization, Viśvāmitra acts as a link in the stream of guides. Its function is not to teach the content, but to point out the right direction, teaching Sudhana that the way involves seeking the right source for each type of specific knowledge.",
      "miraculous_manifestations": "None. This meeting is remarkable for its complete absence of miraculous phenomena, noting that spiritual orientation can manifest itself in extremely simple and direct ways.",
      "spiritual_progression": "Sudhana learns that not every spiritual guide will provide a deep and visionary teaching. Some serve the crucial function of being bridges, and spiritual progression depends on humbly following these connections. The journey is reinforced as a web of contacts, not a series of isolated peaks of wisdom.",
      "transition": "VIśvāmitra Instruui Sudhana to look for śilpābhijña to learn about Bodhisattva's conduct, for he \"studied the knowledge of the words of the bodhisattvas.\" The transition is immediate and direct.",
      "unique_elements": "The simplicity of the guide: VIśVāmitra is the most \"mundane\" kalyāṇamitra so far, a simple teacher.",
      "character": {
        "name": "Viśvāmitra",
        "teaching": "The teaching of this Kalyāṇamitra is humility and recognition of their own limits. Instead of offering a speech or describing a complex realization, Viśvāmitra acts as a link in the stream of guides. Its function is not to teach the content, but to point out the right direction, teaching Sudhana that the way involves seeking the right source for each type of specific knowledge.",
        "description": "Sudhana, after descending from paradise Trāyastriṃśa, finds Viśvāmitra, who is described simply as a teacher of children, and asks for teachings.",
        "occupation": "Teacher/master",
        "meaning": "Universal friend",
        "local": "The city of Kapilavastu.",
        "summary": "Sudhana descends from paradise Trāyastriṃśa to Kapilavastu, where she saw, a children's teacher, simply instructed him to see śilpābhijña in the same city.",
        "chapter_file_name": "46 VIŚVĀMITRA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1Ps6nY9o2HldlOOANyA-PJsbO_QMQ1CJn/view?usp=sharing",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=46",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo46.glb"
      }
    },
    {
      "chapter_number": 47,
      "chapter_title": "Śilpābhijña",
      "name_translation": "Artist",
      "location": "Not specified, but Sudhana finds him after talking to Viśvāmitra.",
      "context": "Following the orientation of Viśvāmitra, Sudhana goes to śilpābhijña and, after formal greetings, asks to be instructed about the conduct of Bodhisattva.",
      "assembly_present": "The meeting is one by one between Sudhana and śilpābhijña.",
      "main_dialogue": "Sudhana asks her default question.In response, śilpābhijña first names its release and then systematically lists the 42 letters and the corresponding wisdom portals he made through them.He concludes humbly stating that this is the scope of his knowledge.",
      "main_teaching": "The release of Bodhisattva called \"Higher Knowledge of the Arts\" (Higher Knowledge of the Arts).The core of teaching is like the most fundamental practice - the study of the alphabet - becomes a portal for the perfection of wisdom.Śilpābhijña demonstrates how the recitation of each of the 42 letters of the alphabet (A, RA, PA, CA, NO, etc.) led him to perform a \"portal for the perfection of\" specific and deep wisdom, each with a poetic and esoteric name (eg \"the field of vajra\", \"the essence of the ocean\", \"the cessation of all torment\").",
      "miraculous_manifestations": "The manifestation is not external or visual, but the revelation of an inner and deep dimension of reality, accessed through the primordial sounds of the alphabet.The miracle is the transformation of a mundane and educational act (learning to read) on a direct path to countless aspects of transcendental wisdom.Art here is not the creation of objects, but the art of extracting the ultimate meaning of the blocks of language construction.",
      "spiritual_progression": "Sudhana learns that the spiritual path can be found in the most unexpected places and that even the most basic elements of worldly experience, such as the alphabet, contain all Dharma.It is exposed to the idea that language is not only descriptive, but also a vehicle for the direct realization of wisdom (a base for later tantric practices).",
      "transition": "Śilpābhijña states that your knowledge is limited to this release.He then directs Sudhana to his next guide: a kalyāṇamitra woman named Bhadrottamam, who resides in the city of Vartanaka, in the Kevalaka region, in the land of Magadha.",
      "unique_elements": "'- The alphabet as a path: The chapter is unique in its approach to using the Sanskrit alphabet as a structure for contemplative practice and a map for the perfection of wisdom.",
      "character": {
        "name": "Śilpābhijña",
        "teaching": "The liberation of Bodhisattva called \"Higher Knowledge of the Arts.\" The core of the teaching is how the most fundamental practice—the study of the alphabet—becomes a portal for the perfection of wisdom. Śilpābhijña demonstrates how the recitation of each of the 42 letters of the alphabet (A, Ra, Pa, Ca, Na, etc.) led him to attain a specific and profound \"portal for the perfection of wisdom,\" each with a poetic and esoteric name (e.g., \"the vajra field,\" \"the essence of the ocean,\" \"the cessation of all torment\").",
        "description": "Following the orientation of Viśvāmitra, Sudhana goes to śilpābhijña and, after formal greetings, asks to be instructed about the conduct of Bodhisattva.",
        "occupation": "Letter",
        "meaning": "Artist",
        "local": "Not specified, but Sudhana finds him after talking to Viśvāmitra.",
        "summary": "Śilpābhijña tells Sudhana that he has reached the Bodhisattvic liberation called the Higher Knowledge of the Arts and describes the various achievements of the perfection of the wisdom he has achieved through the recitation of the letters of the Arapacan alphabet.",
        "chapter_file_name": "47 ŚILPĀBHIJÑA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1US-CI_jW82V6-eW1wfG6MPK3u7omKcYX/view?usp=drive_link,",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=47",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo47.glb"
      }
    },
    {
      "chapter_number": 48,
      "chapter_title": "Bhadrottamam",
      "name_translation": "Excellent supreme woman",
      "location": "The city called Vartanaka in the Kevalaka region.",
      "context": "Sudhana travels to the city of Vartanaka, approaches Bhadrottamam, pays the usual honors and asks to be taught about the conduct of Bodhisattva.",
      "assembly_present": "The meeting is individual between Sudhana and Bhadrottamam.",
      "main_dialogue": "In response to Sudhana's question, Bhadrottamā declares the name of his teaching and his Samādhi, describing the unialed faculties that result from it. She no longer prepares about the content.",
      "main_teaching": "Bhadrottamam claims that he knows and teaches a teaching of the Dharma called \"The Field Without Location\". It reached a Samādhi (meditative state) called \"without impediments\" (Unimpeded).",
      "miraculous_manifestations": "The manifestation described is a state of internal perception and power that arises from its Samādhi. Being in this state, she has the senses of omniscience without impediments (eyes, ears, nose, tongue, body and mind), as well as waves, lightning and power of omniscience without impediments, and the field of enlightenment of beings. There are no external miracles described; The manifestation is the very faculty of transcendental perception.",
      "spiritual_progression": "Sudhana learns about the existence of a teaching focused on a \"field without location\" and a Samādhi that grants direct omniscience faculties and without obstructions. The lesson is about a state of being and realizing that conventional limitations transcend.",
      "transition": "With humility, Bhadrottamā states that he knows only this teaching of Dharma. She then directs Sudhana to the southern region to a city called Bharukaccha, where a goldsmith (Goldsmith) called Muktāsāra resides.",
      "unique_elements": "The field without location: a teaching with an enigmatic name that points to the transcendence of space and place.",
      "character": {
        "name": "Bhadrottamam",
        "teaching": "Bhadrottamam claims that he knows and teaches a Dharma teaching called \"The Field Without Location.\" It reached a samādhi (meditative state) called \"without impediments\" (Unimpeded).",
        "description": "Sudhana travels to the city of Vartanaka, approaches Bhadrottamam, pays the usual honors and asks to be taught about the conduct of Bodhisattva.",
        "occupation": "Lay woman",
        "meaning": "Excellent supreme woman",
        "local": "The city called Vartanaka in the Kevalaka region.",
        "summary": "Sudhana finds bhadrottamam, described simply as a kalyāṇamitra. She states that she has reached the samādhi called the Unimpeded, through which she has unimpeded meanings and other attributes of omniscience.",
        "chapter_file_name": "48 BHADROTTAMĀ.pdf",
        "chapter_url": "https://drive.google.com/file/d/1jV5ZY9LvrniDIdS5GWV9xlmVGxA7ODwT/view?usp=drive_link,",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=48",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo48.glb"
      }
    },
    {
      "chapter_number": 49,
      "chapter_title": "Muktāsāra",
      "name_translation": "Essence of Liberation",
      "location": "The city of Bharukaccha, in the southern region.",
      "context": "Sudhana travels to the city of Bharukaccha, finds the goldsmith Muktāsāra, pays the honors and asks her question about how a bodhisattva should train.",
      "assembly_present": "",
      "main_dialogue": "The dialogue is extremely brief. Sudhana asks, and Muktāsāra responds by naming her release and her practice of seeking Dharma, before humbly declare herself unable to talk about the conduct of great Bodhisattvas.",
      "main_teaching": "Muktāsāra claims to know the release of Bodhisattva called \"The Display of Pure and Unimpeded Memory\". He adds that he continually seeks the Dharma at the Tathāgatas' feet in the ten directions.",
      "miraculous_manifestations": "No external manifestation is described in the text. The release is named, but its effects are not elaborated.",
      "spiritual_progression": "Sudhana learns that spiritual fulfillment can be found in people of ordinary crafts like a goldsmith. It also reunites the name of a liberation you've heard before (from Surendrābhā on Chapter 45), suggesting that the same achievements can be found and expressed by different masters.",
      "transition": "Muktāsāra, claiming only this release, directs Sudhana to the forest next to the city to find a householder called Sucandra, who has a \"house that brights continuously.\"",
      "unique_elements": "The master artisan: reinforces the theme that wisdom can be found in any profession, not just in monastic or divine contexts.",
      "character": {
        "name": "Muktāsāra",
        "teaching": "Muktāsāra claims to know the liberation of the bodhisattva called \"The Display of Pure and Unimpeded Memory.\" He adds that he continually seeks the Dharma at the feet of the tathāgatas in the ten directions.",
        "description": "Sudhana travels to the city of Bharukaccha, finds the goldsmith Muktāsāra, pays the honors and asks her question about how a bodhisattva should train.",
        "occupation": "Goldsmith",
        "meaning": "Essence of Liberation",
        "local": "The city of Bharukaccha, in the southern region.",
        "summary": "Sudhana finds the Muktāsāra goldsmiths in southern Bharukaccha. Muktāsāra says he has reached the bodhisattvic liberation called Pure and Unimpeded Memory Display, and continually seeks Dharma at the feet of the tathāgatas in the ten directions.",
        "chapter_file_name": "49 MUKTĀSĀRA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/11UHAwjXBhI6mY9mBuUa9d_cysRw6EC6a/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=49",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo49.glb"
      }
    },
    {
      "chapter_number": 50,
      "chapter_title": "Scanda",
      "name_translation": "Good moon",
      "location": "In a forest next to the city of Bharukaccha.",
      "context": "Following the nomination of Muktāsāra, Sudhana finds the Sucandra head of household, pays the honors and asks his question about the conduct of Bodhisattva.",
      "assembly_present": "",
      "main_dialogue": "Dialogue is one of the shortest in the journey.Sudhana asks, Sucandra names her release and immediately declares to be unable to know the conduct of Bodhisattvas who have reached countless releases.",
      "main_teaching": "Sucandra states that she knows the release of Bodhisattva called \"The Immaculate Light of Wisdom\".",
      "miraculous_manifestations": "None.The text does not describe any miraculous manifestation;The release is only named.",
      "spiritual_progression": "Sudhana learns about another release, this time linked to \"light\" and \"wisdom\".The encounter with a householder as a master reinforces the idea that the realization is not limited to heavenly monks or beings.The simplicity of the meeting highlights the importance of following the step by step.",
      "transition": "Sucandra, humbly claiming to know only this release, directs Sudhana to the city of Roruka, in the southern region, to find another householder named Ajitasena.",
      "unique_elements": "'- The lay guide: continues the theme of finding deep wisdom in lay practitioners.",
      "character": {
        "name": "Scanda",
        "teaching": "Sucandra states that he knows the liberation of the bodhisattva called \"The Immaculate Light of Wisdom.\"",
        "description": "Following the nomination of Muktāsāra, Sudhana finds the Sucandra head of household, pays the honors and asks his question about the conduct of Bodhisattva.",
        "occupation": "Householder",
        "meaning": "Good moon",
        "local": "In a forest next to the city of Bharukaccha.",
        "summary": "Sudhana finds Sucandra, who tells him that his realization is limited to the bodhisattvic liberation called the Stainless Light of Wisdom.",
        "chapter_file_name": "50 SUCANDRA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1HzymJURMepb_Sx1veZDMbkWIbjVYDRB-/view?usp=drive_link,",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=50",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo50.glb"
      }
    },
    {
      "chapter_number": 51,
      "chapter_title": "Ajitasena",
      "name_translation": "Invincible army",
      "location": "The city of Roruka, in the southern region.",
      "context": "Sudhana arrives in the city of Roruka, approaches the Ajitasena head of household, pays the honors and asks her question about the conduct of Bodhisattva.",
      "assembly_present": "",
      "main_dialogue": "The dialogue is extremely brief. Ajitasena names his release and immediately points to Sudhana to the next master.",
      "main_teaching": "Ajitasena claims to have reached the release of the bodhisattva called \"incessant characteristics\", through which he obtained \"the treasure of the incessant vision of the Buddhas.\"",
      "miraculous_manifestations": "None is described in the text. The release is only named.",
      "spiritual_progression": "Sudhana learns about a realization focused on continuity, specifically, the ability to maintain an \"incessant vision of the Buddhas.\" The meeting reinforces the theme that wisdom can be found in lay practitioners and that the journey progresses through direct connections.",
      "transition": "Ajitasena directs Sudhana to the village called Dharma, in the southern region, to find a Bramane (Brahmin) called śIvarāgra.",
      "unique_elements": "The lay guide: continues the pattern of finding spiritual masters in ordinary social roles.",
      "character": {
        "name": "Ajitasena",
        "teaching": "Ajitasena claims to have reached the liberation of the bodhisattva called \"incessant characteristics,\" through which he obtained \"the treasure of the incessant vision of the buddhas.\"",
        "description": "Sudhana arrives in the city of Roruka, approaches the Ajitasena head of household, pays the honors and asks her question about the conduct of Bodhisattva.",
        "occupation": "Householder",
        "meaning": "Invincible army",
        "local": "The city of Roruka, in the southern region.",
        "summary": "Sudhana finds Ajitasena, who has reached a bodhisattvic liberation called incessant characteristics.",
        "chapter_file_name": "51 AJITASENA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1yl8abtEsit4K0mPrC4117h6LaDs2ehWI/view?usp=drive_link,",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=51",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo51.glb"
      }
    },
    {
      "chapter_number": 52,
      "chapter_title": "ŚIvarāgra",
      "name_translation": "Auspicious peak",
      "location": "The village called Dharma, in the southern region.",
      "context": "Sudhana arrives at the village of Dharma, finds Bramane śivarāgra, pays the honors and asks her question about the conduct of Bodhisattva.",
      "assembly_present": "",
      "main_dialogue": "The dialogue is very brief.ŚIvarāgra explains his conduct based on truth and his power of desire for speech.",
      "main_teaching": "ŚIvarāgra teaches about \"conduct strengthened by truth\" (conduct empowered by Truth).He explains that he has the \"speech of the truth,\" a power that makes bodhisattvas irreversible on the way to enlightenment.Through the strength of this speech, any desire that it formulates for a necessity to be met, is fulfilled.",
      "miraculous_manifestations": "Manifestation is the power inherent in your speech.There are no visual or external miracles described;The power is that their desires are fulfilled when uttered as a speech of the truth.",
      "spiritual_progression": "Sudhana learns about the concept of Satyavākya (speaks of the truth), a practice where total adherence to truth grants spiritual power to manifest reality and ensures progress on the path of bodhisattva.",
      "transition": "Claiming only this power of truth, śIvarāgra directs Sudhana to the city of Sumanāmukha, in the southern region, to find a boy named śrīsaṃbhava and a girl named śrīmatī.",
      "unique_elements": "'- The Power of Truth (Satyavākya): The chapter focuses on this classic power, where the truth becomes a performative force.",
      "character": {
        "name": "ŚIvarāgra",
        "teaching": "ŚIvarāgra teaches about \"conduct empowered by truth.\" He explains that he has the \"speech of truth,\" a power that makes bodhisattvas irreversible on the path to enlightenment. Through the strength of this speech, any wish he formulates for a need to be met is fulfilled.",
        "description": "Sudhana arrives at the village of Dharma, finds Bramane śivarāgra, pays the honors and asks her question about the conduct of Bodhisattva.",
        "occupation": "Brahon",
        "meaning": "Auspicious peak",
        "local": "The village called Dharma, in the southern region.",
        "summary": "Sudhana finds the Bramane śIvarāgra, who has reached the power of the speech of the truth that performs desires.",
        "chapter_file_name": "52 ŚIVARĀGRA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1W7iNLBkDpCzvDz-b1dVYmLvGwv_VgyBU/view?usp=drive_link,",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=52",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo52.glb"
      }
    },
    {
      "chapter_number": 53,
      "chapter_title": "Śrīsaṃbhava and śrīmatī",
      "name_translation": "Glorious origin and the one that has glory",
      "location": "The city of Sumanāmukha, in the southern region.",
      "context": "Sudhana arrives in town and approaches the boy and the girl. After paying his honors, he asks for instruction on Bodhisattva's conduct.",
      "assembly_present": "The meeting is between Sudhana and the two children.",
      "main_dialogue": "The dialogue is extensive. First, they explain in detail the realization of the illusory nature of all phenomena. Then they utter the longest and most detailed speech of the whole Sutra about the importance of Kalyāṇamitra (the spiritual friend), explaining with numerous analogies (mother, father, doctor, guide) that the whole journey of Bodhisattva - from the roots of merit to the final illumination - depends entirely on resting on spiritual guides. They also give Sudhana a long sermon on the vastness of Bodhisattva's practice, exhorting him to never get tired of seeking the kalyāṇamitras or satisfying himself with limited achievements.",
      "main_teaching": "The duo teaches the release of Bodhisattva called \"The appearance of illusion\". They explain that, through this release, they see everything as an illusion: all worlds, karma, afflictions (kleśas), beings, the three kingdoms, and even the śrāvakas, PratyekaBuddhas, and Bodhisattva's own conduct are understood as an illusory nature, arising from interdependent and equally illusory causes and conditions.",
      "miraculous_manifestations": "None. Liberation is a philosophical and contemplative view of the nature of reality, not an exhibition of external phenomena.",
      "spiritual_progression": "Sudhana receives two crucial teachings: the deep vision of the vacuity of all phenomena (Māyopama-Dṛṣṭi) and the most emphatic lesson of Sutra about the absolute need to trust in spiritual friends to navigate the vast and endless path of Bodhisattva. The lesson serves as a final preparation before its meeting with Maitreya.",
      "transition": "The two guides direct Sudhana to their penultimate master, the Bodhisattva Maitreya. They give the exact location: the great pavilion (kūṭāgāra) called Vairocana-vyūhālaṃkāra-garbha, which is within the large park called Mahāvyūha in Samudrakaccha province. They describe the glory of this place and Maitreya's qualities in great detail, and provide Sudhana a long list of specific questions to ask him, preparing the scenario for the beating meeting.",
      "unique_elements": "The illusory nature of everything: an explicit and detailed teaching about seeing all phenomena, including their own way, as a magical illusion.",
      "character": {
        "name": "Śrīsaṃbhava & śrīmati",
        "teaching": "The duo teaches the liberation of the bodhisattva called \"the appearance of illusion\". They explain that, through this liberation, they see everything as an illusion: all worlds, karma, afflictions (kleśas), beings, the three kingdoms, and even the śrāvakas, PratyekaBuddhas, and Bodhisattva's own conduct are understood as an illusory nature, arising from interdependent and equally illusory causes and conditions.",
        "description": "Sudhana arrives in town and approaches the boy and the girl.",
        "occupation": "Young people",
        "meaning": "Glorious origin and the one that has glory",
        "local": "The city of Sumanāmukha, in the southern region.",
        "summary": "Sudhana meets the boy and the girl śrīsaṃbhava and śrīmati. Together, in one voice, they say they reached Bodhisattvic release called the appearance of illusion, through which they see all phenomena as illusions. Being limited to this achievement, they tell Sudhana to go to a kūṭāgāra in southern India, in which the Bodhisattva Maitreya inhabits. They describe the qualities of Maitreya and give Sudhana advice about her practice of Bodhisattva's conduct, long describing the qualities that a Bodhisattva needs to achieve.",
        "chapter_file_name": "53 ŚRĪSAṂBHAVA AND ŚRĪMATI Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1mr_VN1Wgs4lI1C_4gaipkfYEyblp-9Lp/view?usp=drive_link,",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=53",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo53.glb"
      }
    },
    {
      "chapter_number": 54,
      "chapter_title": "Maitreya",
      "name_translation": "Love friend",
      "location": "The Great Pavilion (Kūṭāgāra) called Vairocana-Vyūhālaṃkāra-Garbha, inside Mahāvyūha Park, in the province of Samudrakaccha.",
      "context": "Sudhana arrives at the Great Pavilion portal and, understanding that she is the home of a great Bodhisattva, engages in a long and deep meditation and reverence, praising the pavilion with an extensive series of reflections and a long poem of 55 verses.He then sees Maitreya approaching outside, accompanied by a vast delegation of gods (led by śakra and Brahmā) and Brahumnes.Seeing Sudhana's approach, Maitreya turns to her entourage and praise him extensively in 177 verses, extolling her perseverance, her pure motivation and her devotion to the Kalyāṇamitras, presenting him as a model to follow.Sudhana, thrilled, cries and makes offerings.Only then does he formally ask Maitreya to teach him Bodhisattva's conduct.",
      "assembly_present": "A vast entourage of hundreds of thousands of devas, nāgas, yakṣas, śakra, brahmā and Brahumnes accompany maitreya.The assembly within the tower is cosmic and infinite, containing all assemblies of all three times of the three times.",
      "main_dialogue": "The chapter is dominated by monologues and praises.First, the long silent and poetic tribute from Sudhana to the pavilion.Then the even longer poetic praise of Maitreya to Sudhana.Only after this exchange, Sudhana asks her question.Maitreya's answer is an invitation to enter the tower.The final dialogue occurs after Sudhana leaves the tower, where Maitreya explains the nature of that visionary liberation.",
      "main_teaching": "The release of the bodhisattva called \"the treasure of knowledge that arises from the entrance to all Samādhi fields and which is in accordance with the field of wisdom without impediments.\"Instead of a speech, Maitreya teaches through a direct experience.He snaps his fingers, the pavilion doors open, and he invites Sudhana to enter.Instruction is the vision itself within the tower.",
      "miraculous_manifestations": "The central miracle is the vision within the maitreya pavilion.Sudhana sees that the tower is as vast as heaven, but contains a multitude of other pavilions, each equally vast, which do not obstruct each other.Within this holographic exhibition, he witnesses all of Maitreya's journey over countless Kalpas: his past lives, his Buddhas meetings, his practices of all perfection, his votes, and finally his future lighting like Buddha Maitreya.Sudhana finds herself participating in each of these events, experiencing practice and practice in a moment.Upon leaving, Maitreya explains that this release transcends the notions of coming, going, remaining or not remains, being a reflection of the nature of wisdom.",
      "spiritual_progression": "This is the climax of Sudhana's journey.Not only hears about Bodhisattva's conduct;He experiences it directly, integrating in an instant all of the path taken by a being close to complete lighting.It transcends conceptual learning to experiential accomplishment, understanding the holographic and non-unique nature of reality and the path of Bodhisattva.",
      "transition": "Maitreya, after explaining the tower's view, tells Sudhana that what he saw is just an aspect of the release of Bodhisattva.For the final understanding, Maitreya directs him back to his first guide: \"Go to meet Mañjuśrī and ask him about the supreme conduct.\"Sudhana's journey is thus brought to a complete circle, returning to the starting point for the final synthesis.",
      "unique_elements": "'- The Maitreya Tower: the most powerful symbol of the Sutra, representing the interpenetration of all phenomena (Indra Network), time and space.",
      "character": {
        "name": "Maitreya",
        "teaching": "The liberation of the bodhisattva called \"the treasury of knowledge that arises from entering all samādhi fields and which is in accordance with the field of wisdom without impediments.\" Instead of a speech, Maitreya teaches through a direct experience. He snaps his fingers, the pavilion doors open, and he invites Sudhana to enter. The instruction is the vision itself within the tower.",
        "description": "Sudhana arrives at the Great Pavilion portal and, understanding that she is the home of a great Bodhisattva, engages in a long and deep meditation and reverence, praising the pavilion with an extensive series of reflections and a long poem of 55 verses.",
        "occupation": "Bodhisattva",
        "meaning": "Love friend",
        "local": "The Great Pavilion (Kūṭāgāra) called Vairocana-Vyūhālaṃkāra-Garbha, inside Mahāvyūha Park, in the province of Samudrakaccha.",
        "summary": "Sudhana, in a state of great spiritual achievement, prostrates himself at the door of Kūṭāgāra called Vairocanavyūhūhālaṃkāragarbha and then circle many hundreds of thousands of times. He first lists in prose and then in verse the many inconceivable qualities of the bodhisattvas who have this kūṭāgāra as their residence. Then he sees Maitreya coming with a vast entourage. Maitreya welcomes him in verse, praising him, describing his motivation to come there and giving him instructions.",
        "chapter_file_name": "54 MAITREYA Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/13QCNAUv9uAnZh05Q4Sg4rs-Dkr5zYchz/view?usp=drive_link,",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=54",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo54.glb"
      }
    },
    {
      "chapter_number": 55,
      "chapter_title": "Mañjuśrī",
      "name_translation": "Lord of Wisdom",
      "location": "Sudhana is in the city of Sumanāmukha, while Mañjuśrī is at a distance of 110 Yojanas.",
      "context": "After leaving Maitreya, Sudhana is in the city of Sumanāmukha, thinking and looking for Mañjuśrī, aspiring to see him. Mañjuśrī, from a great distance, extends his hand and places it over Sudhana's head.",
      "assembly_present": "The meeting is a distance interaction between Mañjuśrī and Sudhana.",
      "main_dialogue": "Dialogue is a monologue of Mañjuśrī. He praises Sudhana's perseverance and, by contrast, describes the failures that prevent others from achieving such realization. He then inspires him with a final blessing.",
      "main_teaching": "The teaching is a final encouragement. Mañjuśrī praises Sudhana, saying \"well done, well done!\", And explains that those with weak faith, tired minds, little diligence, or that they are not careful by kalyāṇamitras, would not be able to know the true nature of phenomena or enter the kind of path and field of activity that Sudhana experienced.",
      "miraculous_manifestations": "The main manifestation is the miraculous act of Mañjuśrī extend his arm by a distance of 110 Yojanas to touch Sudhana's head. After encouragement, he inspires Sudhana and possesses him with countless Dharma portals, blessing him with retention, eloquence, samādhi, superior cognitions and infinite wisdom.",
      "spiritual_progression": "This meeting acts as the final confirmation of Sudhana's journey. After receiving the culminating teaching of Maitreya, the blessing of his original guide, Mañjuśrī, seals his realization. It is established in the field of \"completely good conduct\" (the conduct of Samantabhadra), meaning that it is now ready for final practice.",
      "transition": "There is no explicit direction with the formula \"go to ...\" Mañjuśrī simply inspires Sudhana, establishes it in the conduct of Samantabhadra, and then retreats, remaining in its own region. The transition is implicit: having been established in the conduct of Samantabhadra, the next and last logical step for Sudhana is to find Samantabhadra himself.",
      "unique_elements": "The touch at a distance: a unique miracle that demonstrates the power and ubiquitous presence of a large bodhisattva.",
      "character": {
        "name": "Manjushri",
        "teaching": "The teaching is a final encouragement. Mañjuśrī praises Sudhana, saying \"well done, well done!\", And explains that those with weak faith, tired minds, little diligence, or that they are not careful by kalyāṇamitras, would not be able to know the true nature of phenomena or enter the kind of path and field of activity that Sudhana experienced.",
        "description": "After leaving Maitreya, Sudhana is in the city of Sumanāmukha, thinking and looking for Mañjuśrī, aspiring to see him.",
        "occupation": "Bodhisattva",
        "meaning": "Lord of Wisdom",
        "local": "Sudhana is in the city of Sumanāmukha, while Mañjuśrī is at a distance of 110 Yojanas.",
        "summary": "Sudhana passes percent and ten cities until she reaches a district named Sumanāmukha. Mañjuśrī is far one hundred and ten Yojanas, but extends her hand and puts her over Sudhana's head praising him, teaches and blesses, so that Sudhana gets many achievements.",
        "chapter_file_name": "55 MAÑJUŚRĪ Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1309vcohQoA9cXI5n6oPP8hz49nUqjiyP/view?usp=drive_link,",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=55",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo55.glb"
      }
    },
    {
      "chapter_number": 56,
      "chapter_title": "Samantabhadra and the prayer for the completely good conduct",
      "name_translation": "Completely good",
      "location": "In Bodhimaṇḍa, before the Vairocana tathāgata.",
      "context": "After being established in the conduct of Samantabhadra by Mañjuśrī, Sudhana, with a fully purified and focused mind, longing to see Samantabhadra.His aspiration is so powerful that ten omens and ten miraculous lights manifest themselves, purifying all kingdoms and announcing the arrival of Samantabhadra.Sudhana then sees Samantabhadra sitting on a lion throne before the Vairocana Buddha.",
      "assembly_present": "The immediate assembly is that of Buddha Vairocana.However, Sudhana's vision covers the assemblies of all Buddhas in all kingdoms within the Samantabhadra body.Prayer itself addresses all \"lions among men\" in the three times.",
      "main_dialogue": "The dialogue is minimal.Samantabhadra asks Sudhana if he saw his miracles, and Sudhana confirms.Samantabhadra then briefly explains the vastness of time (countless kalpas) which he led to achieve such a body and fulfillment through acts of extreme sacrifice (giving his body, kingdoms, and even his head).The main part of the \"dialogue\" is actually the monologue of the prayer of Samantabhadra, which he recites to further elucidate his conduct.",
      "main_teaching": "The teaching is a direct and visionary transmission.Samantabhadra extends her hand and places her over Sudhana's head.With this touch, Sudhana instantly reaches a state of fulfillment equal to that of Samantabhadra.He enters innumerable Samādhis, perceives oceans of Budic kingdoms, and his practice becomes the same as Samantabhadra and all Tathāgatas.The culmination of the teaching is the recitation of the famous \"Prayer for Completely Good Conduct\" (Bhadracarī-Praṇidhāna), a set of votes that encapsulate the totality of Mahāyāna practice, serving as a guide for all aspirants.",
      "miraculous_manifestations": "This chapter presents the widest manifestations of the whole Sutra.First, the ten omens and the ten lights that announce the vision.Then the very body of Samantabhadra, whose pores emanates infinite clouds of offerings (flowers, perfumes, jewelry), clouds of bodies of devas, and clouds of pure and impure built kingdoms.The culminating view for Sudhana is to perceive, within each poro of Samantabhadra, the totality of all the three-time Buddic kingdoms, each distinct and non-observative, in an infinite holographic exhibition.",
      "spiritual_progression": "Sudhana's journey reaches its absolute conclusion.Not only does he learn, but merges with his final guide, becoming the same as Samantabhadra in conduct and prayers.It becomes a living example of universal practice.Prayer provides it (and the reader) the method for sustaining this achievement forever.",
      "transition": "There is no transition.This is the final chapter.Sudhana's journey is complete, and he now comes into the incessant practice of Samantabhadra's conduct, which continues for all the future kalpas.The conclusion is the fusion of the search engine with the way.",
      "unique_elements": "'- Samantabhadra's prayer (bhadracarī-praṇidhāna): one of the most important and recited texts of the Mahāyāna tradition, which acts as the final synthesis and the Sutra Practice Manual.",
      "character": {
        "name": "Samantabhadra",
        "teaching": "The teaching is a direct and visionary transmission. Samantabhadra extends her hand and places her over Sudhana's head. With this touch, Sudhana instantly reaches a state of fulfillment equal to that of Samantabhadra. He enters innumerable Samādhis, perceives oceans of Budic kingdoms, and his practice becomes the same as Samantabhadra and all Tathāgatas. The culmination of the teaching is the recitation of the famous \"Prayer for Completely Good Conduct\" (Bhadracarī-Praṇidhāna), a set of votes that encapsulate the totality of Mahāyāna practice, serving as a guide for all aspirants.",
        "description": "After being established in the conduct of Samantabhadra by Mañjuśrī, Sudhana, with a fully purified and focused mind, longing to see Samantabhadra.",
        "occupation": "Bodhisattva",
        "meaning": "Completely good",
        "local": "In Bodhimaṇḍa, before the Vairocana tathāgata.",
        "summary": "Sudhana has great achievement and roots of merit, so there are ten events and ten lights that are omens of the appearance of Samantabhadra. Sudhana sees Samantabhadra sitting in front of Buddha, and sees a variety of miraculous events that manifest themselves from Samantabhadra's pores and Samantabhadra's activities in countless kingdoms and through time. As a result, he reaches ten practices of the perfection of knowledge. Then Samantabhadra and all those samantabhadras before each Buddha put their hands over Sudhana's head, and he gets great achievements.",
        "chapter_file_name": "56 SAMANTABHADRA AND \"THE PRAYER FOR Stem Array.pdf",
        "chapter_url": "https://drive.google.com/file/d/1Sh_OpQEZy2OLbkU2JHC2qN20VWY2SOnS/view?usp=drive_link",
        "qr_code_url": "https://technosutra21.github.io/technosutra/?model=56",
        "link_model": "https://cdn.statically.io/gh/technosutra21/technosutra/master/modelo56.glb"
      }
    }
  ]
}